{"Title":"Investing.com--The S&P 500 notched its biggest gain since February on Wednesday, as the Federal Reserve kept rates unchanged, though signaled that it that potential cut in...","Date":1722384000000}
{"Title":"By Max A. Cherney -Arm's conservative revenue forecast sparked a selloff in the British chip firm's stock on Wednesday, as investors worried that returns from a spending frenzy on...","Date":1722384000000}
{"Title":"By Chibuike Oguh NEW YORK (Reuters) - The S&P 500 and Nasdaq scored their biggest daily percentage gains since Feb. 22 and the Dow rose on Wednesday as chip stocks rallied and the...","Date":1722384000000}
{"Title":"By Noel Randewich (Reuters) -Nvidia added about $330 billion in stock market value on Wednesday, a record one-day gain for any company on Wall Street after Microsoft (NASDAQ:MSFT)...","Date":1722384000000}
{"Title":"SANTA CLARA, Calif., July  31, 2024  (GLOBE NEWSWIRE) -- NVIDIA will host a conference call on Wednesday, August 28, at 2 p.m.  PT (5 p.m. ET) to discuss its financial results for...","Date":1722384000000}
{"Title":"By Jamie McGeever (Reuters) - A look at the day ahead in Asian markets.  After an unexpectedly bold move from the Bank of Japan, the Federal Reserve indicating that U.S. rates are...","Date":1722384000000}
{"Title":"By Chris Prentice and Samuel Indyk NEW YORK\/LONDON (Reuters) - Global equities dropped on Thursday, with Wall Street's major indexes selling off as U.S. data sparked economic...","Date":1722470400000}
{"Title":"By Chuck Mikolajczak NEW YORK (Reuters) - U.S. stocks kicked off August sharply lower after a round of economic data on Thursday spurred concerns the economy may be slowing faster...","Date":1722470400000}
{"Title":"By Noel Randewich (Reuters) -U.S. chip stocks plummeted on Thursday in their worst day since 2020 after a conservative forecast from  Arm  Holdings (NASDAQ:ARM) dampened investor...","Date":1722470400000}
{"Title":"By Jody Godoy and Max A. Cherney (Reuters) - U.S. progressive groups and Democratic Senator Elizabeth Warren pressed the Department of Justice to investigate Nvidia (NASDAQ:NVDA)...","Date":1722470400000}
{"Title":"(Reuters) - Global mega tech companies' market capitalisation dropped sharply in July, in response to disappointing quarterly results and concerns over high valuations, prompting...","Date":1722470400000}
{"Title":"(Reuters) - The U.S. Department of Justice is investigating chip giant Nvidia (NASDAQ:NVDA)'s buyout of AI startup Run:ai on antitrust grounds, Politico reported on Thursday,...","Date":1722470400000}
{"Title":"Congresswoman Nancy Pelosi's recent financial disclosure revealed that she bought more NVIDIA (NVDA) shares and sold some Microsoft (NASDAQ:MSFT) shares. According to a new...","Date":1722470400000}
{"Title":"Supermicro, Inc. (SMCI), a Total IT Solution Provider for AI, Cloud, Storage, and 5G\/Edge, is announcing a new addition to its SuperCluster portfolio of plug-and-play AI...","Date":1722470400000}
{"Title":"In a recent congressional trade report, Nancy Pelosi, representing California's 11th congressional district, made notable transactions in the stock market. The report highlighted...","Date":1722470400000}
{"Title":"A look at the day ahead in U.S. and global markets from Mike Dolan The Federal Reserve left Wall Street with little doubt about a first U.S. interest rate cut in seven weeks'...","Date":1722470400000}
{"Title":"(Reuters) - A look at the day ahead in European and global markets from Stella Qiu All eyes are on the Bank of England today, now that the Bank of Japan delivered its second...","Date":1722470400000}
{"Title":"(Reuters) -Artificial intelligence chipmaker Cerebras Systems has confidentially filed for an initial public offering in the United States as it prepares to challenge industry...","Date":1722470400000}
{"Title":"(Reuters) -The U.S. Department of Justice has launched an investigation into Nvidia (NASDAQ:NVDA) after complaints from competitors that it may have abused its market dominance in...","Date":1722556800000}
{"Title":"By Chuck Mikolajczak NEW YORK (Reuters) -U.S. stocks sold off for a second straight session on Friday, and the Nasdaq Composite confirmed it was in correction territory after a...","Date":1722556800000}
{"Title":"NEW YORK (Reuters) -Global equities sold off on Friday and U.S. Treasury yields were at multi-month lows on concerns about the economy and downbeat forecasts from Amazon...","Date":1722556800000}
{"Title":"By Chris Prentice and Naomi Rovnick NEW YORK\/LONDON (Reuters) -Surprisingly weak U.S. employment data on Friday stoked fears of a recession ahead, prompting investors to dump...","Date":1722556800000}
{"Title":"Nvidia Corp  (NASDAQ:NVDA) President and CEO Jen-Hsun Huang has recently sold a substantial number of shares in the company, according to the latest SEC filings. The transactions,...","Date":1722556800000}
{"Title":"By Lewis Krauskopf NEW YORK (Reuters) -Economic fears are roiling Wall Street, as worries grow that the Federal Reserve may have left interest rates elevated for too long,...","Date":1722556800000}
{"Title":"U.Today - Ki Young Ju has reiterated in a recent string of tweets that Bitcoin is the best strategy echoing the opinions of Michael Saylor. The cryptocurrency community is united...","Date":1722556800000}
{"Title":null,"Date":1722556800000}
{"Title":"U.Today - Michael Saylor, a vocal Bitcoin proponent and cofounder of MicroStrategy business intelligence behemoth, has posted a tweet that shows in detail how MicroStrategy has...","Date":1722556800000}
{"Title":"Investing.com -- U.S. stock futures fell sharply Friday ahead of the release of the key nonfarm payrolls number, while tech earnings dominated sentiment. Here are some of the...","Date":1722556800000}
{"Title":"A look at the day ahead in U.S. and global markets from Mike Dolan August looks anxious already - as stock markets take fright at Big Tech earnings and start to reconsider 'hard...","Date":1722556800000}
{"Title":"Investing.com-- NVIDIA Corporation (NASDAQ:NVDA) is facing a probe from the U.S. Department of Justice over complaints its rivals that the chipmaker is abusing its market dominance...","Date":1722556800000}
{"Title":"The AI gold rush is in full swing, but a fund manager is sounding the alarm as he believes the frenzy could turn to dust if the industry doesn't increase its computing...","Date":1722556800000}
{"Title":"Nvidia stock is in a “bubble” and its rally is being driven by an “overhyped” AI technology, hedge fund Elliott Management has told investors in a letter seen by the Financial...","Date":1722556800000}
{"Title":"LONDON (Reuters) - Nvidia (NASDAQ:NVDA) shares fell 2.3% in Frankfurt on Friday, following media reports of the U.S. government launching an antitrust probe into the company...","Date":1722556800000}
{"Title":"(Reuters) - Design flaws could cause a delay of three months or more in the launch of chip giant Nvidia (NASDAQ:NVDA)'s upcoming artificial-intelligence chips, tech-focused...","Date":1722643200000}
{"Title":"By Lewis Krauskopf and Suzanne McGee (Reuters) - A selloff that rocked equity markets around the world is clouding the outlook for investors looking to buy stocks on the cheap, as...","Date":1722729600000}
{"Title":"Investing.com -- Here are the biggest analyst moves in the area of artificial intelligence (AI) for this week. InvestingPro subscribers always get first dibs on market-moving AI...","Date":1722729600000}
{"Title":"On Monday, DA Davidson maintained a Neutral rating on NVIDIA Corporation (NASDAQ: NASDAQ:NVDA) with a price target of $900. To be sure, the investment firm has not adjusted the...","Date":1722816000000}
{"Title":"(Updated - August 5, 2024 11:33 AM EDT) Investing.com -- U.S. stock futures fell sharply Monday on growing fears of an economic slowdown after the release last week of weak...","Date":1722816000000}
{"Title":"The Magnificent 7 stocks experienced significant declines on Monday as the tech sector and broader market faced a severe sell-off. While the stocks have begun to recover slightly...","Date":1722816000000}
{"Title":"By Aditya Soni (Reuters) -Apple and other heavyweight companies sold off on Monday as U.S. recession fears and Berkshire Hathaway (NYSE:BRKa)'s sale of half of its stake in the...","Date":1722816000000}
{"Title":"By Caroline Valetkevitch NEW YORK (Reuters) -U.S. stocks ended with steep losses on Monday, leaving the Nasdaq and S&P 500 down at least 3% each as the market extended last week's...","Date":1722816000000}
{"Title":null,"Date":1722816000000}
{"Title":"Stocks fell sharply on Friday following a surprisingly weak July jobs report, fueling concerns about a potential economic recession. The broad market index dropped 1.84% to close...","Date":1722816000000}
{"Title":"Shares in chipmakers plummeted significantly on Monday amid a global market sell-off, with Japanese stocks plunging by more than 12% due to growing concerns over a potential U.S....","Date":1722816000000}
{"Title":"Nvidia stock (NASDAQ:NVDA) tumbled sharply in premarket trading Monday amid a wider stock market rout caused by concerns that the Federal Reserve may be moving too slowly to prop...","Date":1722816000000}
{"Title":"On Monday, Goldman Sachs reiterated their Conviction Buy rating on NVIDIA (NASDAQ:NVDA) with a steady price target of $135.00. Despite reports of potential delays in the release of...","Date":1722816000000}
{"Title":"The Information reported over the weekend that Nvidia’s next-generation products, based on the Blackwell architecture, might face a delay of at least three months due to design...","Date":1722816000000}
{"Title":"A look at the day ahead in U.S. and global markets from Mike Dolan Whether the prospect of a U.S. recession is real or imagined, the mere return of the discussion has been enough...","Date":1722816000000}
{"Title":"(Reuters) - Semiconductor startup Groq said on Monday it has raised $640 million in a Series D funding round led by Cisco (NASDAQ:CSCO) Investments, Samsung (KS:005930) Catalyst...","Date":1722816000000}
{"Title":"By Caroline Valetkevitch NEW YORK (Reuters) -The S&P 500 and Nasdaq ended 1% higher on Tuesday as investors jumped back into the market a day after a dramatic sell-off, with...","Date":1722902400000}
{"Title":"Investing.com-- The S&P 500 closed higher Tuesday as dip buyers piled into beaten down tech stocks following a rout a day earlier, though gains were limited amid lingers concerns...","Date":1722902400000}
{"Title":"By Lewis Krauskopf NEW YORK (Reuters) - Shares of utilities companies are presenting investors with a rare bright spot in the U.S. stock selloff, as turbulent markets prompt a...","Date":1722902400000}
{"Title":"The earnings call for Super Micro Computer (NASDAQ:SMCI) today is garnering interest as market analysts and investors seek insights into NVIDIA (NVDA) performance and the overall...","Date":1722902400000}
{"Title":"By Harry Robertson LONDON (Reuters) - The sharp sell-off in tech stocks has created opportunities to buy into profitable companies at a cheaper price, the chief investment officer...","Date":1722902400000}
{"Title":"On Tuesday, Rosenblatt Securities maintained its Buy rating and $200.00 price target on NVIDIA Corporation (NASDAQ:NVDA) stock, despite circulating rumors about potential delays in...","Date":1722902400000}
{"Title":null,"Date":1722902400000}
{"Title":"By David Shepardson WASHINGTON (Reuters) - The U.S. Commerce Department said on Tuesday it plans to award SK Hynix up to $450 million in grants to help fund an advanced packaging...","Date":1722902400000}
{"Title":"TAIPEI (Reuters) -Taiwan stocks closed higher on Tuesday from a record plunge on Monday, with contract chipmaker TSMC up 8%, but sentiment remains cautious amid lingering investor...","Date":1722902400000}
{"Title":"Investing.com-- A recent plunge in TSMC’s stock price, on reports of delays in Nvidia’s advanced artificial intelligence chips, was overdone, Citi analysts said in a note, and that...","Date":1722902400000}
{"Title":"New Street Research has raised its rating on Nvidia (NASDAQ:NVDA) stock to a Buy rating with a target price of $120.  The move comes after the chipmaker’s shares declined by 26%...","Date":1722902400000}
{"Title":"By Max A. Cherney SAN FRANCISCO (Reuters) - For U.S. chip giant Intel (NASDAQ:INTC), the darling of the computer age before it fell on harder times in the AI era, things might...","Date":1722988800000}
{"Title":"Investing.com -- The S&P 500 reversed early-day gains to close Wednesday, as a slump in Super Micro Computer pressured chips stocks, weighing on the broader market. At 16:00 ET...","Date":1722988800000}
{"Title":"On Wednesday, Morgan Stanley adjusted its stance on shares of  Sophia Genetics  SA (NASDAQ:SOPH), moving the stock from an Overweight to an Equalweight rating and halving its price...","Date":1722988800000}
{"Title":null,"Date":1722988800000}
{"Title":"By Fanny Potkin and Heekyong Yang SINGAPORE\/SEOUL (Reuters) -A version of Samsung Electronics (KS:005930)' fifth-generation high bandwidth memory (HBM) chips, or HBM3E, has passed...","Date":1722988800000}
{"Title":"By Toby Sterling AMSTERDAM (Reuters) - Belgium's imec, one of the world's top semiconductor R&D firms, on Wednesday reported several computer chip-making breakthroughs at a joint...","Date":1722988800000}
{"Title":"A look at the day ahead in U.S. and global markets from Mike Dolan In an extraordinary round trip over the past week, world markets have rebounded sharply from days of turbulence...","Date":1722988800000}
{"Title":"The Magnificent 7 group of stocks has declined 9% month-to-date through August 5th, underperforming the broader market with the S&P 500 down 6% and the NASDAQ down 8%. Within the...","Date":1722988800000}
{"Title":"By Lewis Krauskopf NEW YORK (Reuters) - Investors are tiptoeing back into shares of U.S. tech stocks following a sharp tumble, even as some still-elevated valuations threaten to...","Date":1723075200000}
{"Title":"By Jeanny Kao and Faith Hung TAIPEI (Reuters) - Taiwan's exports rose less than expected in July as weak demand from China offset record orders from the United States which...","Date":1723075200000}
{"Title":"By Jamie McGeever (Reuters) - A look at the day ahead in Asian markets.  Asia is set for a positive end to a turbulent week on Friday after a rip-roaring U.S. equity rally on...","Date":1723075200000}
{"Title":"By Anirban Sen NEW YORK (Reuters) - Recursion Pharmaceuticals, a biotech firm which uses artificial intelligence to discover new drug candidates, has agreed to buy smaller rival...","Date":1723075200000}
{"Title":"Nvidia’s upcoming earnings report could be the next key catalyst for Big Tech stocks, Barclays strategists said in a note published Friday. Amidst the various macroeconomic factors...","Date":1723161600000}
{"Title":"(Updated - August 9, 2024 12:35 PM EDT) Investing.com -- U.S. stock futures were unchanged Friday, consolidating the previous day's gains after solid labor market data suggesting a...","Date":1723161600000}
{"Title":"Mizuho analysts remain confident in NVIDIA's (NVDA) leadership in the AI GPU space despite recent headlines about modest delays.  According to the latest update, Nvidia...","Date":1723161600000}
{"Title":null,"Date":1723161600000}
{"Title":"By Suzanne McGee (Reuters) - Retail investors were buyers during much of the recent rollercoaster in U.S. stock markets, taking advantage of a sharp fall in popular tech shares,...","Date":1723161600000}
{"Title":"US stocks concluded the week with a modest rebound, with the S&P 500 index rising by 0.5%, therefore marking the strongest consecutive daily gains of the year. The rebound in...","Date":1723248000000}
{"Title":"Investing.com -- Here are the biggest analyst moves in the area of artificial intelligence (AI) for this week. InvestingPro subscribers always get first dibs on market-moving AI...","Date":1723334400000}
{"Title":"By David Randall NEW YORK (Reuters) - A week of wild market swings has investors looking ahead to inflation data, corporate earnings and presidential polls for signals that could...","Date":1723334400000}
{"Title":"By Abigail Summerville (Reuters) -Wall Street stocks closed mixed on Monday as investors braced for a slew of U.S. economic data this week, especially consumer prices, to gauge...","Date":1723420800000}
{"Title":"By Lewis Krauskopf (Reuters) - A look at the day ahead in Asian markets.  Markets looked a whole lot more placid on Monday, a week after equities plunged and volatility measures...","Date":1723420800000}
{"Title":"UBS analysts said in a research note Monday that it has identified that semiconductor stocks, excluding AMD (NASDAQ:AMD) and NVIDIA (NVDA), are currently oversold in some areas,...","Date":1723420800000}
{"Title":"Bank of America analysts have identified three semiconductor stocks that they believe are poised to outperform as the SOX index faces a potential rebound in the fourth...","Date":1723420800000}
{"Title":"Wedbush analysts are reaffirming their bullish outlook on the AI revolution, asserting that the latest tech earnings season has solidified their thesis that AI is on the cusp of a...","Date":1723420800000}
{"Title":"Nvidia Corp  (NASDAQ:NVDA) President and CEO Jen-Hsun Huang has sold a significant portion of his stock in the company, transactions totaling over $24 million. The series of sales...","Date":1723420800000}
{"Title":"(Reuters) - China's Huawei Technologies is close to introducing a new chip for artificial intelligence use to challenge Nvidia (NASDAQ:NVDA) in China amid U.S. sanctions, the Wall...","Date":1723507200000}
{"Title":null,"Date":1723507200000}
{"Title":"Huawei Technologies is nearing the launch of a new AI chip, the Ascend 910C, challenging NVIDIA (NVDA) despite U.S. sanctions, according to a report by the Wall Street Journal on...","Date":1723507200000}
{"Title":"By Abigail Summerville (Reuters) - U.S. indexes closed up on Tuesday and hit a near two-week high after softer producer prices data reinforced bets of an interest-rate cut by the...","Date":1723507200000}
{"Title":"By Jihoon Lee and Cynthia Kim SEOUL (Reuters) - South Korea's mom-and-pop investors are defying last week's global financial markets rout by pouring even more funds into U.S....","Date":1723507200000}
{"Title":"By Nell Mackenzie LONDON (Reuters) - A growing proportion of investors say they plan to decrease the size of hedge fund allocations in their portfolios, survey results from data...","Date":1723593600000}
{"Title":"Barclays' latest supply chain checks for Nvidia (NASDAQ:NVDA) have returned positive results, the investment bank said Wednesday. Barclays said Wednesday its recent conversations...","Date":1723593600000}
{"Title":"Eric Schmidt, former CEO of Google (NASDAQ:GOOGL), expressed his views on a range of topics in a discussion led by Professor Erik Brynjolfsson and students at Stanford...","Date":1723593600000}
{"Title":"By Abigail Summerville (Reuters) -Wall Street's main indexes closed higher on Thursday, with the Nasdaq rising more than 2% after July U.S. retail sales data signaled resilient...","Date":1723680000000}
{"Title":"By Carolina Mandl and David Randall NEW YORK (Reuters) -Tech stocks once again grabbed the attention of the world's biggest funds in the second quarter, regulatory filings showed,...","Date":1723680000000}
{"Title":null,"Date":1723680000000}
{"Title":"(Reuters) - Japanese technology investor SoftBank (TYO:9984) dropped plans of producing an artificial intelligence chip with Intel (NASDAQ:INTC) to compete with Nvidia...","Date":1723680000000}
{"Title":"By Naomi Rovnick LONDON (Reuters) -Big investors are bracing for this summer's stock market rout to run into the autumn, fearing a broader wave of selling will follow the turmoil...","Date":1723680000000}
{"Title":"Nvidia (NASDAQ:NVDA) is likely to continue delivering earnings beats in the coming quarters, “albeit smaller ones,” Jefferies analysts said in a Thursday note. The investment bank...","Date":1723766400000}
{"Title":"A look at the day ahead in U.S. and global markets from Mike Dolan The U.S. economy is doing just fine and markets now accept a quarter-point rate cut from the Federal Reserve...","Date":1723766400000}
{"Title":"Investing.com — While we still have arguably the most important name in the current market, NVIDIA (NASDAQ:NVDA), lined up to report on August 28, the picture for the Q2...","Date":1723766400000}
{"Title":"The Nasdaq and tech stocks are poised for significant gains heading into year-end, driven by the accelerating AI revolution, according to a recent note from Wedbush...","Date":1723766400000}
{"Title":"(Updated - August 16, 2024 12:00 PM EDT) Investing.com -- U.S. stock futures were unchanged Friday, consolidating recent gains after healthy economic data eased concerns of an...","Date":1723766400000}
{"Title":"By Lewis Krauskopf NEW YORK (Reuters) - Hopes for an economic soft landing are once again powering U.S. stocks higher, as encouraging data relieve recession worries following a...","Date":1723852800000}
{"Title":"SEOUL (Reuters) - South Korean artificial-intelligence chip makers Rebellions Inc and Sapeon Korea Inc have signed a definitive merger agreement, the privately held companies said...","Date":1723852800000}
{"Title":null,"Date":1723939200000}
{"Title":"By Lewis Krauskopf NEW YORK (Reuters) -Hopes for an economic soft landing are once again powering U.S. stocks higher, as encouraging data relieve recession worries following a...","Date":1723939200000}
{"Title":"By Stephen Culp NEW YORK (Reuters) - U.S. stocks advanced on Monday, building on their largest weekly percentage gain of the year as investors focused on the Democratic National...","Date":1724025600000}
{"Title":"By Max A. Cherney (Reuters) -AMD said on Monday it plans to acquire server maker ZT Systems for $4.9 billion as the company seeks to expand its portfolio of artificial...","Date":1724025600000}
{"Title":"Bank of America analysts believe that U.S. equities are well-positioned to continue their upward trajectory, provided that economic growth remains stable.  In a recent note, the...","Date":1724025600000}
{"Title":"On Monday, Goldman Sachs reiterated its Conviction Buy rating on shares of NVIDIA Corporation (NASDAQ:NVDA), with a price target of $135.00. The firm anticipates NVIDIA's upcoming...","Date":1724025600000}
{"Title":null,"Date":1724025600000}
{"Title":"Wall Street anticipates another strong quarter for Nvidia (NASDAQ:NVDA) as investors’ favorite chipmaker prepares to release its fiscal Q2 2025 results on August 28. The company’s...","Date":1724025600000}
{"Title":"According to Axios, NVIDIA (NVDA) Research has unveiled a new generative AI weather model that significantly enhances the accuracy of short-range weather forecasts, with the...","Date":1724025600000}
{"Title":"AI darling Nvidia (NASDAQ:NVDA) will report its second-quarter results of fiscal 2025 on Aug. 28, with significant attention expected on management's comments regarding potential...","Date":1724112000000}
{"Title":null,"Date":1724112000000}
{"Title":"On Tuesday, Stifel, a financial services company, maintained its Buy rating on NVIDIA (NASDAQ:NVDA) shares, with a price target set at $165.00. The firm's outlook comes ahead of...","Date":1724112000000}
{"Title":"Bank of America strategists disclosed on Tuesday the eight most widely held individual stocks globally. Based on the percentage of relevant funds holding these stocks, the top...","Date":1724112000000}
{"Title":"Chipmaker AMD (NASDAQ:AMD) announced on Monday it plans to acquire server manufacturer ZT Systems for $4.9 billion, a strategic move aimed at broadening its portfolio of AI chips...","Date":1724112000000}
{"Title":"By Noel Randewich (Reuters) - The S&P 500 will trade near current record levels at year-end, according to a Reuters poll of market strategists that suggests the AI rally is losing...","Date":1724112000000}
{"Title":null,"Date":1724198400000}
{"Title":"On Wednesday, Citi maintained a positive stance on NVIDIA Corporation (NASDAQ:NVDA), reiterating a Buy rating and a $150.00 price target. The firm's analyst projected NVIDIA's...","Date":1724198400000}
{"Title":"On Wednesday, HSBC analyst updated their outlook on shares of NVIDIA Corporation (NASDAQ:NVDA), increasing the price target to $145 from $135 while maintaining a Buy rating on the...","Date":1724198400000}
{"Title":"Deutsche Bank has reiterated a Hold rating on NVIDIA (NASDAQ: NASDAQ:NVDA) with a steady price target of $100.00. The firm anticipates another robust quarter for NVIDIA,...","Date":1724198400000}
{"Title":"Mutual funds made minimal changes to their sector positions in 2Q, marking the smallest shift since 2013, according to Goldman Sachs. Per the bank’s report released Tuesday, the...","Date":1724198400000}
{"Title":"By Jamie McGeever ORLANDO, Florida (Reuters) -Bond investors are by default pessimists and equity investors are naturally optimistic. But this market maxim doesn't fully explain...","Date":1724198400000}
{"Title":"Politics is among key catalysts driving higher volatility within the current bull trend, Evercore ISI analysts noted Tuesday. The report suggests that the volatility spikes seen in...","Date":1724198400000}
{"Title":"By Eduardo Baptista, Fanny Potkin and Karen Freifeld BEIJING\/SINGAPORE\/NEW YORK (Reuters) - State-linked Chinese entities are using cloud services provided by Amazon (NASDAQ:AMZN)...","Date":1724284800000}
{"Title":"(Reuters) - Nvidia (NASDAQ:NVDA) and Jeff Bezos-backed Perplexity AI said on Thursday that it plans to introduce advertising on its artificial intelligence-powered search platform...","Date":1724284800000}
{"Title":"Nvidia (NASDAQ:NVDA) continues to be one of the most demanded stocks in the tech sector, with Itau BBA analysts offering a detailed assessment of its prospects and a fair price...","Date":1724284800000}
{"Title":"On Thursday, KeyBanc Capital Markets maintained its Overweight rating and $180.00 price target for NVIDIA Corporation (NASDAQ:NVDA), despite a reported delay in the release of the...","Date":1724284800000}
{"Title":"Investing.com-- Most Asian stocks fell on Friday as markets gauged hawkish comments from the Bank of Japan and mixed Japanese inflation data, with focus turning squarely to an...","Date":1724284800000}
{"Title":null,"Date":1724284800000}
{"Title":"Nvidia (NASDAQ:NVDA), a key player in the AI boom of the past two years, is set to report its second-quarter earnings for fiscal 2025 next week. Among other things, investors will...","Date":1724284800000}
{"Title":"On Thursday, Rosenblatt Securities maintained a bullish stance on NVIDIA Corporation (NASDAQ:NVDA) stock, reiterating a Buy rating and a $200.00 price target for the stock.  The...","Date":1724284800000}
{"Title":"KeyBanc Capital Markets maintained its Overweight rating and $180.00 price target for NVIDIA Corporation (NASDAQ:NVDA), despite a reported delay in the release of the Blackwell...","Date":1724284800000}
{"Title":"On Friday, a Melius analyst maintained a Buy rating and a $160.00 price target for NVIDIA Corporation (NASDAQ:NVDA), expressing optimism despite recent challenges. The analyst...","Date":1724371200000}
{"Title":"By David Randall NEW YORK (Reuters) - The rally in U.S. stocks faces an important test next week with earnings from chipmaking giant Nvidia (NASDAQ:NVDA), whose blistering run has...","Date":1724371200000}
{"Title":"Chinese state-linked entities are increasingly turning to cloud services from Amazon (NASDAQ:AMZN) and its rivals to access advanced U.S. chips and artificial intelligence (AI)...","Date":1724371200000}
{"Title":"On Friday, Citi reaffirmed its Buy rating on NVIDIA (NASDAQ:NVDA) with a steady price target of $150.00. The endorsement comes as NVIDIA gears up to unveil new architectural...","Date":1724371200000}
{"Title":"(Updated - August 23, 2024 12:29 PM EDT) Investing.com -- U.S. stock futures rose Friday, ending the week on a positive tone, after Fed chair Jerome Powell signaled the Fed would...","Date":1724371200000}
{"Title":null,"Date":1724371200000}
{"Title":"On Friday, Evercore ISI increased its price target on NVIDIA (NASDAQ:NVDA) shares, a leading technology company known for its advanced graphics processing units (GPUs). The new...","Date":1724371200000}
{"Title":"(Reuters) -State-linked Chinese entities are using cloud services provided by Amazon (NASDAQ:AMZN) or its rivals to access advanced U.S. chips and artificial intelligence...","Date":1724371200000}
{"Title":"As markets eagerly anticipate Nvidia (NASDAQ:NVDA)'s upcoming earnings report, Barclays analysts warn that it could serve as a \"reality check\" for the broader market, particularly...","Date":1724371200000}
{"Title":"A look at the day ahead in U.S. and global markets from Mike Dolan Jerome Powell takes centre stage at the Federal Reserve's Jackson Hole jamboree on Friday but the Fed chair...","Date":1724371200000}
{"Title":"Evercore ISI analysts advised investors to buy Nvidia (NASDAQ:NVDA) stock ahead of the chipmaker’s earnings report for the July quarter, stressing that recent concerns over...","Date":1724371200000}
{"Title":"LONDON (Reuters) - The latest earnings from AI darling Nvidia (NASDAQ:NVDA) and key inflation numbers in the euro area and Australia should keep markets busy in the coming week....","Date":1724371200000}
{"Title":"By Qiaoyi Li and Kevin Krolicki BEIJING (Reuters) - China dominates the market for electric vehicles. Now it's chasing Tesla (NASDAQ:TSLA) in the race to build battery-powered...","Date":1724371200000}
{"Title":"In a note to clients published Friday, Jefferies strategists outlined what they believe are the 10 most actionable policies if Kamala Harris wins the presidential election, based...","Date":1724457600000}
{"Title":"A survey conducted by Evercore ISI showed a shift in expectations regarding the upcoming U.S. presidential election. The survey, which gathered responses from nearly 350...","Date":1724457600000}
{"Title":"Investing.com -- Here are the biggest analyst moves in the area of artificial intelligence (AI) for this week. InvestingPro subscribers always get first dibs on market-moving AI...","Date":1724544000000}
{"Title":"Investing.com -- The rally in U.S. markets will be tested this week when earnings from chipmaking giant Nvidia (NASDAQ:NVDA) are released. U.S. inflation data will likely underline...","Date":1724544000000}
{"Title":"Investing.com-- Asian stocks were a mixed bag on Monday, taking some support from expectations of lower U.S. interest rates although Japanese markets retreated amid pressure from...","Date":1724544000000}
{"Title":"Investing.com-- Most Asian stocks fell on Tuesday, with sentiment towards Chinese markets worsening after Canada joined the U.S. and Europe in imposing steep import tariffs on the...","Date":1724630400000}
{"Title":"By Johann M Cherian and Noel Randewich (Reuters) -The S&P 500 finished lower on Monday, with AI heavyweight Nvidia (NASDAQ:NVDA) dipping ahead of its quarterly report this week,...","Date":1724630400000}
{"Title":"By Jamie McGeever (Reuters) - A look at the day ahead in Asian markets. World markets are entering a period of nervous uncertainty as investors try to determine whether upcoming...","Date":1724630400000}
{"Title":"By Chibuike Oguh and Dhara Ranasinghe NEW YORK\/LONDON (Reuters) -World equity markets edged lower on Monday as investors digested the likelihood of U.S. interest rates being...","Date":1724630400000}
{"Title":"Investing.com-- The Dow closed at record highs Monday, as cyclical stocks including financials were back in favor amid a rotation out from tech ahead of a widely expected Federal...","Date":1724630400000}
{"Title":"U.Today - Michael Saylor, co-founder and chairman of MicroStrategy, has made a bold statement that has resonated with the crypto community, as Bitcoin briefly touched the $65,000...","Date":1724630400000}
{"Title":"Nvidia (NASDAQ:NVDA)'s upcoming earnings report represents an \"underpriced risk\" for the broader market, according to analysts at Bank of America. While recent market attention has...","Date":1724630400000}
{"Title":"Nvidia Corporation (NASDAQ:NVDA) is slated to report its earnings after the market closes on August 28. Market participants are anticipating a significant stock price movement,...","Date":1724630400000}
{"Title":"(Updated - August 26, 2024 11:50 AM EDT) Investing.com -- U.S. stock futures were mixed Monday, with strength in the Dow and weakness in the Nasdaq and S&P 500, ahead of results...","Date":1724630400000}
{"Title":"On Monday, Morgan Stanley reiterated its Overweight rating on shares of NVIDIA (NASDAQ:NVDA) with a steady price target of $144.00. The firm continues to hold NVIDIA as its Top...","Date":1724630400000}
{"Title":"Nasdaq Falls Ahead of NVIDIA (NASDAQ:NVDA) Results Wednesday, Down 0.8%NVDA -1.8%NVIDIA will host a conference call on Wednesday, August 28, at 2 p.m. PT (5 p.m. ET) to discuss...","Date":1724630400000}
{"Title":"LONDON (Reuters) -The latest earnings from AI darling Nvidia (NASDAQ:NVDA) and key inflation numbers in the euro area and Australia should keep markets busy in the coming week....","Date":1724630400000}
{"Title":"Investing.com -- U.S. futures remain subdued on Monday at the start of a week which will bring Nvidia (NASDAQ:NVDA) earnings and inflation data that will likely cement expectations...","Date":1724630400000}
{"Title":"Nvidia (NASDAQ:NVDA) is due to report earnings this week and while an above-consensus print is expected, the spotlight will be on guidance “as investors remain skittish on AI...","Date":1724630400000}
{"Title":"A look at the day ahead in European and global markets from Wayne Cole. Asia has seen an extension of the Powell rally so far on Monday with yields and the dollar down, and most...","Date":1724630400000}
{"Title":null,"Date":1724630400000}
{"Title":"U.S. stocks climbed on Friday after Federal Reserve Chair Jerome Powell hinted that interest rate cuts are on the horizon. The Dow Jones Industrial Average rose by 462.30 points,...","Date":1724630400000}
{"Title":"Investing.com-- Most Asian stocks retreated on Wednesday with technology-heavy indexes falling in anticipation of earnings from market darling Nvidia, while Australian stocks sank...","Date":1724716800000}
{"Title":"By Noel Randewich (Reuters) -The S&P 500 ended higher on Tuesday and the Dow Jones notched a record-high close ahead of a much-anticipated quarterly report from Nvidia...","Date":1724716800000}
{"Title":"By Jamie McGeever (Reuters) - A look at the day ahead in Asian markets. The mood across Asian markets on Wednesday is likely to be one of caution, for two main reasons that should...","Date":1724716800000}
{"Title":"By Chibuike Oguh and Iain Withers NEW YORK\/LONDON (Reuters) -A gauge of global shares climbed in choppy trading while oil prices slipped on Tuesday as investors weighed...","Date":1724716800000}
{"Title":"Investing.com-- The Dow closed at a fresh record high Tuesday, despite cautious sentiment as investors awaited results from chipmaking giant Nvidia (NASDAQ:NVDA) due Wednesday.  By...","Date":1724716800000}
{"Title":"CrowdStrike (NASDAQ:CRWD) today announced it is providing additional safeguards for NVIDIA (NASDAQ:NVDA) NIM Agent Blueprints with the AI-native CrowdStrike Falcon® cybersecurity...","Date":1724716800000}
{"Title":"Catalog of Customizable Workflows Speeds Deployments of Core Generative AI Use Cases, Starting With Customer Service, Drug Discovery (NASDAQ:WBD) and Data Extraction for PDFs, With...","Date":1724716800000}
{"Title":"By Max A. Cherney SAN FRANCISCO (Reuters) - Cerebras Systems launched on Tuesday a tool for AI developers that allows them to access the startup's outsized chips to run...","Date":1724716800000}
{"Title":"On Tuesday, Truist Securities adjusted its financial outlook for NVIDIA (NASDAQ:NVDA), increasing the stock's price target to $145.00 from $140.00, while reiterating a Buy rating....","Date":1724716800000}
{"Title":"A look at the day ahead in European and global markets from Ankur Banerjee Optimism over looming U.S. interest rate cuts have been tempered by nervousness over what economic data...","Date":1724716800000}
{"Title":"Investing.com -- Wall Street is seen trading in tight ranges Tuesday, with the focus on Apple after its announcement of management changes. Paramount will also be in the spotlight...","Date":1724716800000}
{"Title":"By Arsheeya Bajwa (Reuters) - Nvidia (NASDAQ:NVDA) is likely to report on Wednesday that its second-quarter revenue more than doubled. But investors used to its blockbuster...","Date":1724716800000}
{"Title":"Mizuho has issued a cautious update on Micron Technology (NASDAQ: NASDAQ:MU) shares due to anticipated downturns in the DRAM sector.  The firm's memory analyst in Asia, Marcus...","Date":1724716800000}
{"Title":"A look at the day ahead in U.S. and global markets from Mike Dolan Wall Street stocks are back just shy of new record highs, lapping up the likely start of Federal Reserve easing...","Date":1724716800000}
{"Title":"Investing.com -- U.S. stock futures traded largely flat Tuesday, stabilizing after some volatile sessions resulted in a new all-time high for the blue chip Dow Jones Industrial...","Date":1724716800000}
{"Title":"The U.S. dollar has been on a downtrend and should that continue, there will be “better things to own than Nvidia” for investors, Gavekal Research said in a Monday report. The...","Date":1724716800000}
{"Title":null,"Date":1724716800000}
{"Title":"NVIDIA (NASDAQ:NVDA) announced: On August 26, 2024, the Board of Directors approved an additional $50.0 billion in share repurchase authorization, without expiration.","Date":1724803200000}
{"Title":"Investing.com-- Asian stocks retreated on Thursday, pressured chiefly by losses in the technology sector following underwhelming guidance from market darling Nvidia, although...","Date":1724803200000}
{"Title":"Investing.com-- Asian chipmaking stocks fell on Thursday, tracking overnight losses in market darling Nvidia after the chipmaker’s guidance on revenue and margins underwhelmed,...","Date":1724803200000}
{"Title":"By Noel Randewich and Johann M Cherian (Reuters) -U.S. stocks fell on Wednesday ahead of a quarterly report from Nvidia (NASDAQ:NVDA), Wall Street's centerpiece event of the week...","Date":1724803200000}
{"Title":"By Jamie McGeever (Reuters) - A look at the day ahead in Asian markets. Hold on to your hats, or prepare for lift off?  In the end, the much-anticipated release of Nvidia...","Date":1724803200000}
{"Title":"By Chibuike Oguh and Lawrence White NEW YORK\/LONDON (Reuters) -Global equity markets eased while the U.S. dollar rebounded on Wednesday, and then chipmaker Nvidia (NASDAQ:NVDA)'s...","Date":1724803200000}
{"Title":"By Fergal Smith (Reuters) - Canada's main stock index extended its pullback from a record high on Wednesday, as profit-taking in most sectors of the market offset gains for...","Date":1724803200000}
{"Title":"After-Hours Stock Movers: NVIDIA (NASDAQ:NVDA) shares were choppy after the AI juggernaut published second quarter results and guidance, and announced a $50 billion buyback plan....","Date":1724803200000}
{"Title":"Investing.com - NVIDIA (NASDAQ: NVDA) reported third quarter EPS of $0.68, $0.04 better than the analyst estimate of $0.64. Revenue for the quarter came in at $30B versus the...","Date":1724803200000}
{"Title":"Record quarterly revenue of $30.0 billion, up 15% from Q1 and up 122% from a year ago  Record quarterly Data Center revenue of $26.3 billion, up 16% from Q1 and up 154% from a year...","Date":1724803200000}
{"Title":"Investing.com -- The S&P 500 closed lower Wednesday, as weakness in Nvidia led a slide in tech just ahead of the chipmaker's quarterly results.  At 16:00 ET (20:00 GMT), Dow Jones...","Date":1724803200000}
{"Title":"A look at the day ahead in European and global markets from Tom Westbrook Nvidia (NASDAQ:NVDA) is holding the investment world in thrall ahead of an earnings report later today...","Date":1724803200000}
{"Title":"(Reuters) - Elon Musk's AI startup, xAI, is facing criticism from environmental and health advocates for allegedly contributing to pollution in Memphis, Tennessee, by using...","Date":1724803200000}
{"Title":"Investing.com -- Wall Street is warily awaiting the release of the latest quarterly results from chipmaking giant Nvidia, with blowout results likely needed to keep market...","Date":1724803200000}
{"Title":"A look at the day ahead in U.S. and global markets from Mike Dolan Nvidia (NASDAQ:NVDA)'s post-bell earnings update on Wednesday is keeping stock markets everywhere in a holding...","Date":1724803200000}
{"Title":"Recent movements in macro assets on Nvidia earnings demonstrate the major role of the AI theme and the chipmaker as a key market bellwether, Goldman Sachs said in a Wednesday...","Date":1724803200000}
{"Title":"Investing.com -- Ahead of Nvidia’s much-anticipated earnings report on Wednesday, Investing.com conducted a poll to gauge investor expectations for the stock's reaction after the...","Date":1724803200000}
{"Title":"Hedge funds have reduced their exposure to Nvidia (NASDAQ:NVDA) and the broader \"Magnificent 7\" group of tech stocks during the second and third quarters of 2024, according to a...","Date":1724803200000}
{"Title":"By Pranav Kashyap and Lisa Pauline Mattackal (Reuters) -The benchmark European stock index rose to its highest since July on Wednesday, boosted by insurance and chemical stocks...","Date":1724803200000}
{"Title":"By Saqib Iqbal Ahmed NEW YORK (Reuters) - Traders in the U.S. equity options market are expecting Nvidia (NASDAQ:NVDA)'s upcoming earnings report to spark a more than $300 billion...","Date":1724803200000}
{"Title":"Investing.com -- Nvidia (NASDAQ:NVDA) is set to deliver what Wedbush analysts described in a note on Wednesday as \"the most important earnings report for the stock market this...","Date":1724803200000}
{"Title":"On Thursday, BofA Securities showed continued confidence in NVIDIA (NASDAQ:NVDA), a leading graphics chipmaker, by increasing its price target from $150.00 to $165.00. The firm...","Date":1724889600000}
{"Title":"On Thursday, KeyBanc reaffirmed its positive stance on NVIDIA Corporation (NASDAQ:NVDA), maintaining an Overweight rating and a price target of $180.00. The endorsement comes even...","Date":1724889600000}
{"Title":"Wall Street analysts are encouraging investors to buy the latest pullback in Nvidia shares. The AI darling’s quarterly forecast on Wednesday fell short of the lofty expectations...","Date":1724889600000}
{"Title":null,"Date":1724889600000}
{"Title":"On Thursday, Wolfe Research maintained a positive outlook on NVIDIA Corporation (NASDAQ:NVDA), reaffirming an Outperform rating and a price target of $150.00. The firm's analysis...","Date":1724889600000}
{"Title":"Citi analysts on Thursday moved Apple stock to their “top AI pick” going into 2025, above Nvidia (NASDAQ:NVDA) and  Arista Networks  (NYSE:ANET). The move comes as Apple Inc...","Date":1724889600000}
{"Title":"On Thursday, UBS reaffirmed its confidence in NVIDIA Corporation (NASDAQ:NVDA) stock, maintaining a Buy rating and a price target of $150.  The endorsement comes despite a recent...","Date":1724889600000}
{"Title":"On Thursday, NVIDIA Corporation (NASDAQ:NVDA) saw its price target increased by Raymond James from $120 to $140, with a continued Strong Buy rating. The adjustment follows NVIDIA's...","Date":1724889600000}
{"Title":"Jefferies has maintained a confident stance on NVIDIA Corporation (NASDAQ: NASDAQ:NVDA), reiterating a Buy rating and a price target of $150.00.  The firm highlighted that despite...","Date":1724889600000}
{"Title":"Mizuho has maintained its Outperform rating on NVIDIA Corporation (NASDAQ: NASDAQ:NVDA) and increased its price target to $140 from $132 on NVIDIA's strong quarterly performance...","Date":1724889600000}
{"Title":"Cantor Fitzgerald has reaffirmed its positive stance on NVIDIA Corporation (NASDAQ: NASDAQ:NVDA), maintaining an Overweight rating and a $175.00 price target for the stock. The...","Date":1724889600000}
{"Title":"By Deborah Mary Sophia, Noel Randewich and Saqib Iqbal Ahmed (Reuters) -Nvidia shares dropped more than 6% on Thursday after its forecast fell short of lofty expectations, though...","Date":1724889600000}
{"Title":"On Thursday, DA Davidson maintained a neutral stance on NVIDIA Corporation (NASDAQ:NVDA), confirming a price target of $90.00. The firm's outlook follows NVIDIA's report of robust...","Date":1724889600000}
{"Title":"Investing.com-- Asian stocks rose on Friday as technology stocks recovered from Nvidia-induced losses, while month-end bargain buying saw Chinese shares rebound from more-than...","Date":1724889600000}
{"Title":"By Jaspreet Singh (Reuters) -Dell Technologies raised its annual revenue and profit forecasts on Thursday, buoyed by demand for its AI-optimized servers that are powered by Nvidia...","Date":1724889600000}
{"Title":"By Johann M Cherian and Noel Randewich (Reuters) - The Dow notched a record high close on Thursday in mixed trading following robust U.S. economic data, while artificial...","Date":1724889600000}
{"Title":"(Reuters) - AI startup OpenAI said on Thursday its chatbot ChatGPT now has more than 200 million weekly active users, double the number it had in the last fall season. ChatGPT,...","Date":1724889600000}
{"Title":"By Suzanne McGee (Reuters) - Interest in leveraged exchange-traded funds that allow investors to profit when shares of Nvidia (NASDAQ:NVDA) fall grew steadily ahead of the...","Date":1724889600000}
{"Title":"SANTA CLARA, Calif., Aug.  29, 2024  (GLOBE NEWSWIRE) -- NVIDIA will present at the following event for the financial community: Goldman Sachs Communacopia + Technology...","Date":1724889600000}
{"Title":"On Thursday, Truist Securities adjusted its financial outlook on NVIDIA Corporation (NASDAQ:NVDA), increasing the price target to $148 from the previous $145 while sustaining a Buy...","Date":1724889600000}
{"Title":"Investing.com -- Nvidia (NASDAQ:NVDA)'s recent earnings report delivered what AI bulls Wedbush called a \"masterpiece performance\" in a note Thursday, solidifying the company's...","Date":1724889600000}
{"Title":"Investing.com-- The S&P 500 eked out a gain on Thursday as Nvidia dragged tech lower, though data pointing to a stronger U.S. economy allayed recession fears, keeping downside...","Date":1724889600000}
{"Title":"By Pranav Kashyap and Lisa Pauline Mattackal (Reuters) -Europe's STOXX 600 rose on Thursday and Germany's DAX closed at a record high, led by tech stocks, after softer inflation...","Date":1724889600000}
{"Title":"On Thursday, Baird, a prominent investment firm, increased its price target for NVIDIA (NASDAQ:NVDA), a leading technology company, to $150 from the previous $120. The firm also...","Date":1724889600000}
{"Title":"On Thursday, Rosenblatt Securities sustained its positive outlook on shares of NVIDIA Corporation (NASDAQ:NVDA), upholding a Buy rating and a $200.00 price target. The firm's...","Date":1724889600000}
{"Title":"On Thursday, Needham, a financial services firm, increased its price target on shares of NVIDIA (NASDAQ: NVDA) to $145 from the previous $120, while reaffirming a Buy rating on the...","Date":1724889600000}
{"Title":"On Thursday, Edward Jones maintained a Hold rating on NVIDIA (NASDAQ:NVDA), a leading global provider of high-performance graphics processing units (GPUs). The firm's stance...","Date":1724889600000}
{"Title":"On Thursday, TD Cowen maintained a bullish stance on shares of NVIDIA Corporation (NASDAQ:NVDA), reiterating a Buy rating and a $165.00 price target. The firm's assessment follows...","Date":1724889600000}
{"Title":"Investing.com -- Analysts on Wall Street reiterated their bullish views on Taiwan Semiconductor (TSMC) shares after the latest Nvidia (NASDAQ:NVDA) earnings report. Following the...","Date":1724889600000}
{"Title":"Investing.com -- Nvidia (NASDAQ:NVDA)'s stock is trading lower Thursday premarket, currently down around 2.9%, despite the company's \"beat and raise\" quarterly results after the...","Date":1724889600000}
{"Title":"On Thursday, Barclays reiterated its Overweight rating on NVIDIA (NASDAQ:NVDA) stock with a $145.00 price target. The firm's analysis acknowledged some concerns but ultimately...","Date":1724889600000}
{"Title":"On Thursday, Goldman Sachs maintained its Conviction Buy rating on NVIDIA Corporation (NASDAQ:NVDA) and increased the price target to $135.00. The firm's analyst cited the...","Date":1724889600000}
{"Title":"Investing.com-- Analysts maintained a bullish view on NVIDIA Corporation (NASDAQ:NVDA) even after some projections from the chipmaker missed expectations, with sustained demand...","Date":1724889600000}
{"Title":"Investing.com -- Nvidia reported Wednesday better-than-expected Q2 results, and the chipmaker announced a $50B stock buyback program.  NVIDIA Corporation (NASDAQ:NVDA) dropped...","Date":1724889600000}
{"Title":"Investing.com -- Wall Street is seen trading slightly higher Thursday ahead of more labor macro data, as investors digest results from AI darling Nvidia. There are more corporate...","Date":1724889600000}
{"Title":"By Arsheeya Bajwa (Reuters) - Nations building artificial intelligence models in their own languages are turning to Nvidia (NASDAQ:NVDA)'s chips, adding to already booming demand...","Date":1724889600000}
{"Title":"By Arsheeya Bajwa (Reuters) -Nvidia's quarterly forecast on Wednesday failed to meet lofty expectations of investors who have driven a dizzying rally in its stock as they bet...","Date":1724889600000}
{"Title":"A look at the day ahead in European and global markets from Stella Qiu  It is a sea of red in Asia as AI darling Nvidia (NASDAQ:NVDA) failed to meet expectations of investors who...","Date":1724889600000}
{"Title":"On Thursday, Citi reiterated its positive stance on NVIDIA (NASDAQ:NVDA), maintaining a Buy rating and a $150.00 price target for the stock. The firm's outlook follows NVIDIA's...","Date":1724889600000}
{"Title":"On Thursday, Bernstein, a research firm, increased its price target on shares of NVIDIA Corporation (NASDAQ:NVDA) to $155 from the previous $130, while maintaining an Outperform...","Date":1724889600000}
{"Title":"On Thursday, Stifel reaffirmed its confidence in NVIDIA Corporation (NASDAQ:NVDA) stock, maintaining a Buy rating and a $165.00 price target.  The endorsement follows NVIDIA's...","Date":1724889600000}
{"Title":"NVIDIA Corporation (NASDAQ:NVDA) has reported a record-breaking revenue of $30 billion in its second-quarter earnings call, marking a 15% increase from the last quarter and a...","Date":1724889600000}
{"Title":"On Thursday, Piper Sandler reaffirmed its confidence in NVIDIA Corporation (NASDAQ:NVDA) stock, sustaining an Overweight rating and a $140.00 price target on the shares.  The...","Date":1724889600000}
{"Title":"On Thursday, NVIDIA Corporation (NASDAQ:NVDA) stock maintained its Outperform rating with a steady price target of $150.00, as per Oppenheimer's latest report.  The firm...","Date":1724889600000}
{"Title":"NVIDIA Corporation (NASDAQ: NASDAQ:NVDA) has maintained its Buy rating from Summit Insights, despite the firm expressing concerns over the tech giant's gross margin outlook for the...","Date":1724889600000}
{"Title":"By Noel Randewich (Reuters) -Wall Street stocks rose and the Dow scored a second consecutive all-time closing high on Friday, with Tesla (NASDAQ:TSLA) and Amazon climbing after...","Date":1724976000000}
{"Title":"By Suzanne McGee (Reuters) - A golden era for cash may be winding down as the Federal Reserve gets ready to cut interest rates. Many fans of the investment class are staying put...","Date":1724976000000}
{"Title":"On Thursday, a Craig-Hallum analyst increased the price target for NVIDIA (NASDAQ:NVDA) shares to $165 from $125, while reiterating a Buy rating on the stock. The adjustment...","Date":1724976000000}
{"Title":"A look at the day ahead in U.S. and global markets from Mike Dolan Record stock market highs have lit up across the world once again - though not yet for the usual suspects in the...","Date":1724976000000}
{"Title":"Despite recent market volatility, Barclays analysts maintain that the AI investment theme remains robust.  The bank said in a note Friday that while equities have been navigating...","Date":1724976000000}
{"Title":"(Reuters) -Shares of Dell Technologies (NYSE:DELL) rose 4% on Friday, after robust demand for its artificial intelligence-powered servers prompted the company to raise its...","Date":1724976000000}
{"Title":"Investing.com-- The S&P 500 closed higher Friday, closing out the month of August with a fourth-month win as easing economic concerns triggered a sharp rebound in stocks following...","Date":1724976000000}
{"Title":"By David Randall NEW YORK (Reuters) - A broadening rally in U.S. stocks is offering an encouraging signal to investors worried about concentration in technology shares, as markets...","Date":1724976000000}
{"Title":"By David Randall NEW YORK (Reuters) -A broadening rally in U.S. stocks is offering an encouraging signal to investors worried about concentration in technology shares, as markets...","Date":1725148800000}
{"Title":"Investing.com -- Here are the biggest analyst moves in the area of artificial intelligence (AI) for this week. InvestingPro subscribers always get first dibs on market-moving AI...","Date":1725148800000}
{"Title":"By Max A. Cherney and Milana Vinn (Reuters) - Intel (NASDAQ:INTC) CEO Pat Gelsinger and key executives are expected to present a plan later this month to the company’s board of...","Date":1725235200000}
{"Title":"TAIPEI (Reuters) - Former U.S. President Donald Trump \"has a lot on his plate\" and misunderstands Taiwan's role in the semiconductor industry, possibly because others have...","Date":1725235200000}
{"Title":"Investing.com -- Intel (NASDAQ:INTC) CEO Pat Gelsinger is set to present a strategic overhaul to its board of directors later this month, aimed at streamlining its operations and...","Date":1725235200000}
{"Title":"Nvidia (NASDAQ:NVDA)'s Chief Executive Jensen Huang is pushing the company's strategy to become a comprehensive provider of data center components, including software, networking...","Date":1725235200000}
{"Title":"(Reuters) - Wall Street's main indexes slid on Tuesday, with the S&P 500 down more than 2% and the Nasdaq Composite down over 3% as investors softened their optimism about AI in a...","Date":1725321600000}
{"Title":"(Reuters) -The U.S. Department of Justice has sent a subpoena to Nvidia (NASDAQ:NVDA) as it deepens its probe into the AI heavyweight's antitrust practices, Bloomberg News...","Date":1725321600000}
{"Title":"By Jamie McGeever (Reuters) - A look at the day ahead in Asian markets. World markets will open on an extremely shaky footing on Wednesday after a gloomy snapshot of U.S. factory...","Date":1725321600000}
{"Title":"After-Hours Stock Movers: NVIDIA (NASDAQ:NVDA) fell 2.1%, extending an intraday slump of 9.5% that erased $279 billion in market value. The afterhours decline was tied in part to a...","Date":1725321600000}
{"Title":"By Chibuike Oguh NEW YORK (Reuters) -U.S. stocks slumped on Tuesday, at the start of one of the market's historically worst months, ahead of data likely to influence how much the...","Date":1725321600000}
{"Title":"Investing.com - The Nasdaq suffered its biggest one-day slump since the August global selloff, as an Nvidia slump triggered a sea of red across stocks ahead of the slew of economic...","Date":1725321600000}
{"Title":"By Jamie McGeever ORLANDO, Florida (Reuters) - Nvidia (NASDAQ:NVDA)'s share price slump after its strong, but not exceptionally strong, second-quarter results raises a broader...","Date":1725321600000}
{"Title":"(This Sept. 2 story has been corrected to remove Delta Corp which was erroneously included in the list in both graphics) (Reuters) - Market values of major tech firms declined in...","Date":1725321600000}
{"Title":"Citi analysts remain optimistic about the fundamental setup for the S&P 500 in the second half of 2024, despite lingering concerns about a potential recession.  In their recent...","Date":1725321600000}
{"Title":null,"Date":1725321600000}
{"Title":"Investing.com -- Shares in Nvidia (NASDAQ:NVDA) were slightly higher in early US trading, paring back earlier losses, after Bloomberg News reported that the company had been sent a...","Date":1725408000000}
{"Title":"(Reuters) - Hewlett Packard Enterprise (NYSE:HPE) raised its annual profit forecast on Wednesday, as demand for artificial intelligence servers continues to pick up owing to...","Date":1725408000000}
{"Title":"In a recent move, Jen-Hsun Huang, the President and CEO of  Nvidia Corp  (NASDAQ:NVDA), has sold a considerable amount of company stock, totaling over $27 million. The transactions...","Date":1725408000000}
{"Title":"Investing.com - The S&P 500 slipped on Wednesday, as Nvidia's rebound faded, keeping a lid on tech stocks despite a sharp drop in Treasury yields amid rising bets on a jumbo Fed...","Date":1725408000000}
{"Title":null,"Date":1725408000000}
{"Title":"U.Today - Investors and players on the United States financial market have been reminded of the volatility that characterizes the space. In a post on X, Ran Neuner, CNBC Crypto...","Date":1725408000000}
{"Title":"U.Today - CNBC Mad Money host, financial commentator Jim Cramer has taken to his account on the X platform to share why he believes the current sell-off on the markets is taking...","Date":1725408000000}
{"Title":"By Deborah Mary Sophia (Reuters) - Nvidia (NASDAQ:NVDA)'s shares recouped earlier losses to trade higher on Wednesday, propping up chip firms after a bruising sell-off in the...","Date":1725408000000}
{"Title":"By Shubham Batra and Lisa Pauline Mattackal (Reuters) -Europe's main share indices fell to a two-week low on Wednesday, with technology stocks leading declines as concerns of an...","Date":1725408000000}
{"Title":"By Lewis Krauskopf NEW YORK (Reuters) - Shares of Nvidia (NASDAQ:NVDA) and other Big Tech stocks have helped power the markets run to record highs this year. Their recent wobble...","Date":1725408000000}
{"Title":"Investing.com -- Ongoing volatility in equities is expected in near-term, although shares should trade higher in the coming 6-12 months, according to analysts at UBS. US stocks...","Date":1725408000000}
{"Title":"By Arsheeya Bajwa (Reuters) -Intel was one of the first two tech companies to join the Dow Jones Industrial Average during the late-'90s dot-com boom, along with Microsoft...","Date":1725408000000}
{"Title":"Investing.com -- Solid earnings growth during Q2 is “insufficient” to sustain the stock market rally and a recession later this year, BCA Research noted in a Tuesday...","Date":1725408000000}
{"Title":"By Naomi Rovnick LONDON (Reuters) - Mounting unease over the U.S. economic outlook and a seasonally weak month for stocks have created another perfect storm of global market...","Date":1725408000000}
{"Title":"Investing.com - European stock markets fell Wednesday, following the sharp selloff seen on Wall Street overnight as growth concerns weighed heavily on the market-leading tech...","Date":1725408000000}
{"Title":"(Reuters) -Chip shares dragged Asian indexes lower on Wednesday and European futures fell after growth concerns drove the steepest selloff in a month on Wall Street and investors...","Date":1725408000000}
{"Title":"Investing.com -- The Nvidia-fueled tech rally is likely to slow and turn volatile as economic headwinds and chip regulation weigh, according to analysts at UBS.    \"Future gains in...","Date":1725408000000}
{"Title":"Investing.com -- After the market reopened following the Labor Day weekend, tech stocks faced significant pressure in a broader risk-off market. However, analysts at Wedbush remain...","Date":1725408000000}
{"Title":"Investing.com -- US futures dip following a downbeat day to kick off September for Wall Street. Technology names, in particular artificial intelligence focal point Nvidia...","Date":1725408000000}
{"Title":"By Ben Blanchard and Heekyong Yang TAIPEI (Reuters) - Senior executives from two of the world's most important chipmakers, Taiwan's TSMC and South Korea's Samsung Electronics...","Date":1725408000000}
{"Title":"Intel's (NASDAQ:INTC) contract manufacturing business has suffered a setback after tests with Broadcom (NASDAQ:AVGO) failed, Reuters reported Wednesday, citing sources familiar...","Date":1725408000000}
{"Title":"Investing.com -- U.S. stock futures fell Wednesday, pointing to further losses after the previous session’s sharp selloff on growth concerns. Here are some of the biggest...","Date":1725408000000}
{"Title":"By Noel Randewich and Suzanne McGee (Reuters) -Shares of AI heavyweight Nvidia (NASDAQ:NVDA) tumbled 9.5% on Tuesday in the deepest ever single-day decline in market value for a...","Date":1725408000000}
{"Title":"Investing.com -- Shares in ASML Holding (AS:ASML) and STMicroelectronics (EPA:STMPA) were among the biggest losers on the pan-European Stoxx 600 on Wednesday, following a sharp...","Date":1725408000000}
{"Title":"(Reuters) -Applied Digital shares soared nearly 65% to hit their highest level in more than a month on Thursday, after the data center operator said it would receive $160 million...","Date":1725494400000}
{"Title":"By Chibuike Oguh NEW YORK (Reuters) -The benchmark S&P 500 index and the Dow ended lower in choppy trading on Thursday after a short-lived boost from a string of economic reports...","Date":1725494400000}
{"Title":"Investing.com -- Advanced Micro Devices (NASDAQ:AMD) saw a slight dip in market share in server instances in July, according to a note from Jefferies on Thursday. The report...","Date":1725494400000}
{"Title":"Investing.com -- U.S. stock futures declined Thursday following data that showed private employers hired fewer workers, ahead of the release of the key monthly jobs report...","Date":1725494400000}
{"Title":"(This Sept. 3 story has been officially corrected to fix the time frame of when Nvidia (NASDAQ:NVDA) stock traded sideways and removes reference to 'most of the last quarter,' in...","Date":1725494400000}
{"Title":"NEW YORK (Reuters) - Prominent activist short seller Andrew Left will face trial in September 2025 over allegations he committed fraud, after his lawyers and U.S. prosecutors...","Date":1725494400000}
{"Title":"By Marie Mannes and Nick Carey (Reuters) -Swedish automaker Volvo (OTC:VLVLY) Cars slashed its margin and revenue ambitions for a second time in a year on Thursday, a day after it...","Date":1725494400000}
{"Title":"Erste Group downgraded shares of Intel Corporation (NASDAQ:INTC) from Hold to Sell, citing increased competition from Advanced Micro Devices (NASDAQ:AMD) in the central processing...","Date":1725494400000}
{"Title":"U.Today - Samson Mow, prominent Bitcoin evangelist and CEO at JAN3 BTC adoption-focused company, has shared that he believes he is currently in a situation similar to Michael Burry...","Date":1725494400000}
{"Title":null,"Date":1725494400000}
{"Title":"Data center operator Applied Digital (APLD) raised $160 million in a funding round, the Wall Street Journal reported Thursday. The company’s CEO Wes Cummins revealed that Nvidia...","Date":1725494400000}
{"Title":"Applied Digital Corporation (Nasdaq: APLD) (“Applied Digital” or the “Company”), a designer, builder, and operator of next-generation digital infrastructure designed for...","Date":1725494400000}
{"Title":"Investing.com -- Bank of America reiterated its Buy rating on Nvidia (NASDAQ:NVDA), maintaining a price objective of $165 on the stock, citing \"compelling growth at [a] compelling...","Date":1725494400000}
{"Title":"Investing.com -- U.S. stock futures traded in tight ranges Thursday, steadying ahead of the release of more key labor market data to guide future Federal Reserve monetary policy...","Date":1725494400000}
{"Title":"Investing.com -- The AI sector is not in a bubble, Goldman Sachs strategists said in a Thursday note, but concentration risks remain elevated due to the dominance of a few...","Date":1725494400000}
{"Title":"Investing.com -- US stock futures hover mostly above the flatline on Thursday, ahead of a raft of new labor market figures due out this week that may play into an upcoming Federal...","Date":1725494400000}
{"Title":"BofA Securities maintained a Buy rating on NVIDIA (NASDAQ:NVDA) with a price target of $165.00. The firm acknowledged several challenges facing NVIDIA in the near term, including...","Date":1725494400000}
{"Title":"By Chibuike Oguh NEW YORK (Reuters) -U.S. stocks fell on Friday, weighed down by a jobs report that showed a continued labor market slowdown but left traders uncertain about how...","Date":1725580800000}
{"Title":"By Lewis Krauskopf and David Randall NEW YORK (Reuters) -Uncertainty over the U.S. economy's health is rippling through markets, adding fuel to an already-volatile period that has...","Date":1725580800000}
{"Title":"NVIDIA Corp (NASDAQ:NVDA) President and CEO Jen-Hsun Huang has recently sold a significant amount of company stock, totaling over $25 million. The transactions, which took place on...","Date":1725580800000}
{"Title":"By Akash Sriram and Arsheeya Bajwa (Reuters) -Broadcom's shares closed down 10% on Friday after the chipmaker's tepid revenue forecast spooked investors betting on robust demand...","Date":1725580800000}
{"Title":"Fantasy Stock Trading Game Teaches and Rewards Next Generation of Top Traders DALLAS, Sept. 6, 2024 \/PRNewswire\/ -- TradeOff, the next-generation stock trading platform that seeks...","Date":1725580800000}
{"Title":"Mizuho analysts updated their Top Picks List, adding Micron (NASDAQ:MU) and Oracle (NYSE:ORCL) to the roster. Other stocks that were added as a part of the September update are...","Date":1725580800000}
{"Title":null,"Date":1725580800000}
{"Title":"Investing.com -- Stock futures on Wall Street edge lower ahead of the publication of this week's all-important labor market report, which could influence the size of a possible...","Date":1725580800000}
{"Title":"(Updated - September 6, 2024 12:06 PM EDT) Investing.com -- US stock futures were lower on Friday after a mixed labor market report muddled forecasters' projections on the size of...","Date":1725580800000}
{"Title":"Investing.com -- In the current volatile market, where mega-cap tech stocks are seeing fluctuations and bond yields are moving unpredictably, however, one sector shines for its...","Date":1725667200000}
{"Title":"Investing.com -- Here are the biggest analyst moves in the area of artificial intelligence (AI) for this week. InvestingPro subscribers always get first dibs on market-moving AI...","Date":1725753600000}
{"Title":"By Lewis Krauskopf and David Randall NEW YORK (Reuters) -Uncertainty over the U.S. economy's health is rippling through markets, adding fuel to an already-volatile period that has...","Date":1725753600000}
{"Title":"By Jamie McGeever (Reuters) - A look at the day ahead in Asian markets. Asian stocks are set to open sharply lower on Monday, tracking Wall Street's slump on Friday after...","Date":1725753600000}
{"Title":"U.Today - Michael Saylor, the famous Bitcoin bull, shared the successes of MicroStrategy's cryptocurrency strategy on CNBC. As the price of BTC has risen an average of 44% per year...","Date":1725840000000}
{"Title":"By Jamie McGeever (Reuters) - A look at the day ahead in Asian markets. The volatility that scarred global markets last week is giving way to a greater degree of calm early this...","Date":1725840000000}
{"Title":"Citi has reaffirmed its Buy rating on NVIDIA Corporation (NASDAQ: NASDAQ:NVDA) with a steady price target of $150.00.   The endorsement comes after Mercury Research published its...","Date":1725840000000}
{"Title":"TAIPEI (Reuters) - Taiwan's exports rose more than expected in August to an all-time monthly high of nearly $44 billion, as growing demand for chips to supply the burgeoning...","Date":1725840000000}
{"Title":"Investing.com -- Over the past two decades, the technology sector has emerged as a major driver of market returns, outperforming broader market indices.  This performance has been...","Date":1725840000000}
{"Title":"Investing.com -- Nvidia (NASDAQ:NVDA)'s gross margins have been under scrutiny, but according to Morgan Stanley analysts in a note to clients on Monday, the concerns are largely...","Date":1725840000000}
{"Title":"Investing.com -- According to Evercore ISI analysts in a note to clients on Monday, the recent selloff in the S&P 500 presents a buying opportunity despite ongoing market...","Date":1725840000000}
{"Title":null,"Date":1725840000000}
{"Title":"In a recent series of transactions, Jen-Hsun Huang, the President and CEO of  Nvidia Corp  (NASDAQ:NVDA), sold shares of the company's stock valued at over $25 million. The sales...","Date":1725926400000}
{"Title":"By Zaheer Kachwala (Reuters) - Oracle (NYSE:ORCL) shares rose more than 10% on Tuesday as a push to embed AI into its cloud service products boosted its first-quarter results and...","Date":1725926400000}
{"Title":"Investing.com -- Data center operator  Switch  (NYSE:SWCH) is in discussions over a potential initial public offering (IPO) that could value the busienss at around $40 billion,...","Date":1725926400000}
{"Title":"Investing.com -- According to the latest Sevens Report Research note, the S&P 500 may face a significant drop into the low 4,000s in a worst-case scenario, if economic conditions...","Date":1725926400000}
{"Title":"By Echo Wang and David French NEW YORK (Reuters) - The owners of  Switch  (NYSE:SWCH) are exploring an initial public offering (IPO) of the data center operator that could value...","Date":1725926400000}
{"Title":"JFrog Ltd. (“JFrog”) (Nasdaq: FROG), the Liquid Software company and creators of the JFrog Software Supply Chain Platform, now expanded to include a unified MLOps platform through...","Date":1725926400000}
{"Title":null,"Date":1725926400000}
{"Title":"Investing.com -- In a note to clients on Tuesday, HSBC said it is bullish on AMD (NASDAQ:AMD), citing significant upside potential in AI-driven revenue that the market has yet to...","Date":1725926400000}
{"Title":"Investing.com-- Most Asian stocks rose on Thursday with technology shares tracking an overnight rally in market darling Nvidia, while Japanese markets soared as a soft reading on...","Date":1726012800000}
{"Title":"Investing.com-- Shares of Nvidia rose sharply on Wednesday, underpinning a broader rally in technology stocks after Chief Executive Jensen Huang said the company was experiencing...","Date":1726012800000}
{"Title":"Investing.com -- ChatGPT parent Open AI is talks to raise around $6.5 billion from investors, taking its valuation to around $150B, well above its prior $86B valuation, Bloomberg...","Date":1726012800000}
{"Title":"Investing.com -- Nvidia jumped on Wednesday as the U.S. government is mulling whether to lift ban that would allow the chipmaker to export advanced chips to Saudi Arabia, Semafor...","Date":1726012800000}
{"Title":"The question of whether the bubble in AI equities has already burst is increasingly relevant, especially after a rapid rise in valuations. Investing.com -- According to Capital...","Date":1726012800000}
{"Title":"On Wednesday, Goldman Sachs reaffirmed its Conviction Buy rating on NVIDIA (NASDAQ:NVDA), with a steady price target of $135.00. The endorsement follows remarks from NVIDIA's...","Date":1726012800000}
{"Title":null,"Date":1726012800000}
{"Title":"(Reuters) -The U.S. government is considering allowing Nvidia (NASDAQ:NVDA) to export advanced chips to Saudi Arabia, which would help the country train and run the most powerful...","Date":1726012800000}
{"Title":"Investing.com-- Asian chipmaking stocks rose on Thursday, tracking an overnight rally in Nvidia after CEO Jensen Huang offered encouraging comments on artificial...","Date":1726099200000}
{"Title":"Investing.com -- US stock futures edged up on Thursday following a tech-fueled rally on Wall Street in the previous session. OpenAI is reportedly in talks to raise funds at a $150...","Date":1726099200000}
{"Title":"A look at the day ahead in U.S. and global markets by Amanda Cooper. The first cut might be the deepest in some cases, but in the case of the Federal Reserve, it would seem not....","Date":1726099200000}
{"Title":"Investing.com -- US stock futures moved higher on Thursday, pointing to an extension in a tech-fueled rally in stocks in the prior session. By 07:00 ET (11:00 GMT), the Dow futures...","Date":1726099200000}
{"Title":null,"Date":1726099200000}
{"Title":"Investing.com -- The S&P 500 closed higher Thursday, shrugging off a hotter-than-anticipated producer price data as focus shifted to the widely expected Federal Reserve interest...","Date":1726099200000}
{"Title":"Nvidia Corp  (NASDAQ:NVDA) President and CEO Jen-Hsun Huang has sold a significant portion of his holdings in the company, according to recent filings with the Securities and...","Date":1726099200000}
{"Title":"By Sinéad Carew and Shashwat Chauhan (Reuters) -Wall Street's main indexes closed higher on Thursday after the latest inflation data reinforced expectations for a 25-basis point...","Date":1726099200000}
{"Title":"A look at the day ahead in European and global markets from Stella Qiu Asian stock markets were broadly higher as investors regained some of their love for tech stocks, and Nvidia...","Date":1726099200000}
{"Title":"Representative Pete Sessions, from Texas's 17th congressional district, recently made notable movements in his investment portfolio, according to a newly released congressional...","Date":1726185600000}
{"Title":null,"Date":1726185600000}
{"Title":"Investing.com -- Goldman Sachs analysts told investors in a recent note to seize the opportunity in AI stocks following a recent dip, stating that AI-related companies remain...","Date":1726185600000}
{"Title":"Investing.com -- US stocks opened higher on Friday, as investors held on to expectations of lower interest rates ahead of a Federal Reserve meeting that could potentially herald a...","Date":1726185600000}
{"Title":"By Krystal Hu and Kenrick Cai (Reuters) - OpenAI's new financing round is expected to come in the form of convertible notes, according to sources with direct knowledge of the...","Date":1726272000000}
{"Title":"This summer marked a significant turning point in global markets, driven by four key developments, according to analysts at Gavekal Research in a note this week. First, the firm...","Date":1726358400000}
{"Title":"The Federal Reserve is set to begin its interest rate-cutting cycle this week after years of hikes and restrictive policies. Ahead of the much-anticipated pivot, tech investors are...","Date":1726444800000}
{"Title":"Investing.com -- Shares in Intel (NASDAQ:INTC) rose in premarket trading on Monday after Bloomberg News reported that the US chipmaking giant had officially qualified for as much...","Date":1726444800000}
{"Title":"By Saqib Iqbal Ahmed NEW YORK (Reuters) -Nvidia's huge stock rally is still exerting an outsized influence over the S&P 500 index, reinforcing concerns that broader markets could...","Date":1726444800000}
{"Title":null,"Date":1726444800000}
{"Title":"Nvidia Corp  (NASDAQ:NVDA) President and CEO Jen-Hsun Huang has disposed of company shares valued at more than $28 million, according to a recent regulatory filing. The...","Date":1726444800000}
{"Title":"By John Kruzel WASHINGTON (Reuters) - A case involving the vape industry gives the U.S. Supreme Court a chance to further erode the authority of federal regulatory agencies...","Date":1726444800000}
{"Title":null,"Date":1726531200000}
{"Title":"Investing.com-- Microsoft Corporation (NASDAQ:MSFT) and asset manager BlackRock Inc (NYSE:BLK) said they will launch an over $30 billion fund to invest in artificial intelligence...","Date":1726531200000}
{"Title":"Salesforce (NYSE:CRM) and NVIDIA (NASDAQ:NVDA) today announced a strategic collaboration to develop advanced AI capabilities for the enterprise with autonomous agent and...","Date":1726531200000}
{"Title":"Investing.com -- Analysts at Bank of America (BofA) hiked their rating on  Hewlett Packard Enterprise Co  (NYSE:HPE) shares to Buy from Neutral and lifted the price target on the...","Date":1726531200000}
{"Title":"Investing.com -- Mizuho Securities in a note dated Monday have initiated coverage on two major players in the AI server market, namely Dell Technologies (NYSE:DELL) and Super Micro...","Date":1726531200000}
{"Title":"By Deborah Mary Sophia and Arsheeya Bajwa (Reuters) -Intel shares jumped almost 4% in early trading on Tuesday, as a chip-making deal with Amazon (NASDAQ:AMZN)'s cloud business...","Date":1726531200000}
{"Title":"NVIDIA Corporation (NASDAQ:NVDA) has reported a record-breaking revenue of $30 billion in its second-quarter earnings call, marking a 15% increase from the last quarter and a...","Date":1726617600000}
{"Title":"NVIDIA (NVDA) gained a new bull on Wall Street as William Blair initiated coverage of the stock with an Outperform rating, citing the company's leadership in parallel computing and...","Date":1726617600000}
{"Title":null,"Date":1726617600000}
{"Title":"In a recent development, Pete Sessions, the congressional representative from Texas's 17th district, has made a noteworthy transaction in the stock market. The transaction involved...","Date":1726617600000}
{"Title":"By Chuck Mikolajczak NEW YORK (Reuters) -U.S. stocks closed with modest losses on Wednesday, well off their intraday highs, after the Federal Reserve cut interest rates by 50...","Date":1726617600000}
{"Title":"Tech bulls Wedbush said in a note Thursday that they believe the AI revolution trade has gained momentum after the Federal Reserve's 50 basis point rate cut, signaling a risk-on...","Date":1726704000000}
{"Title":"By Noel Randewich and Purvi Agarwal (Reuters) -The S&P 500 surged to a record high close on Thursday, the day after the Federal Reserve cut interest rates by 50 basis points and...","Date":1726704000000}
{"Title":null,"Date":1726790400000}
{"Title":"Nvidia Corp 's (NASDAQ:NVDA) Executive Vice President and Chief Financial Officer, Colette Kress, has made significant transactions in the company's stock, according to a recent...","Date":1726790400000}
{"Title":"Nvidia Corp  (NASDAQ:NVDA) has reported a recent transaction involving the sale of company shares by Principal Accounting Officer, Donald F. Robertson Jr. According to the latest...","Date":1726790400000}
{"Title":"A committee of experts from top U.S. medical centers and research institutes is harnessing NVIDIA (NASDAQ:NVDA)-powered federated learning to evaluate the impact of federated...","Date":1726790400000}
{"Title":"By Lewis Krauskopf NEW YORK (Reuters) -As the Federal Reserve kicks off a long-awaited rate cutting cycle, some investors are wary that richly valued U.S. stocks may have already...","Date":1726790400000}
{"Title":"New York, United States, September 20th, 2024, Chainwire The Ignition AI Accelerator, a collaborative initiative between NVIDIA (NASDAQ:NVDA), Tribe, and Digital Industry...","Date":1726790400000}
{"Title":"Investing.com -- Here are the biggest analyst moves in the area of artificial intelligence (AI) for this week. InvestingPro subscribers always get first dibs on market-moving AI...","Date":1726963200000}
{"Title":null,"Date":1727049600000}
{"Title":"D.A. Davidson analysts downgraded Microsoft (NASDAQ:MSFT) on Monday from a Buy to a Neutral rating, while maintaining a $475 price target. The firm cited intensifying competition...","Date":1727049600000}
{"Title":"By Alexander Cornwell DUBAI (Reuters) - President Joe Biden will host the United Arab Emirates president on Monday for a visit set to include White House talks on the Gulf state's...","Date":1727049600000}
{"Title":"A Loop Capital analyst adjusted their price target for Super Micro Computer Inc (NASDAQ:SMCI) stock on Monday, reducing it from $1,500 to $1,000, citing the AI server maker’s...","Date":1727049600000}
{"Title":"Bernstein analysts are optimistic about NVIDIA's (NVDA) datacenter revenues heading into Q4, expecting them to show strong growth. \"Datacenter revenues into Q4 look strong,\" said...","Date":1727049600000}
{"Title":"In a recent transaction, Coxe Tench, a director at  Nvidia Corp  (NASDAQ:NVDA), sold a significant amount of company stock, totaling over $235 million. The sales took place over...","Date":1727049600000}
{"Title":"NVIDIA (NVDA) is experiencing strong demand for its Hopper and Blackwell GPUs, according to Morgan Stanley analysts. The investment bank said in a note Tuesday that Nvidia’s...","Date":1727136000000}
{"Title":null,"Date":1727136000000}
{"Title":"By Joyce Lee and Hyunjoo Jin SEOUL (Reuters) - SK Hynix shares jumped more than 9% on Thursday after the South Korean firm started mass production of the most advanced...","Date":1727222400000}
{"Title":"Investing.com-- OpenAI is working on a plan to restructure its core business into a for-profit structure in a bid to make the ChatGPT maker more attractive to investors, with CEO...","Date":1727222400000}
{"Title":"By Harshita Mary Varghese (Reuters) -Micron Technology shares surged roughly 14% in after-hours trading after the memory maker forecast higher than expected first-quarter revenue...","Date":1727222400000}
{"Title":"After-Hours Stock Movers: Micron Technology (NASDAQ:MU) rose 12% after it published strong quarterly results. Management said robust AI demand drove a strong ramp of data center...","Date":1727222400000}
{"Title":"Investing.com-- The S&P 500 fell Wednesday, as investors hit pause on the recent rally and awaited further catalysts including key inflation data later this week.  At 4:00 p.m. ET...","Date":1727222400000}
{"Title":"Shares of former U.S. President Donald Trump's media company sprang back over 6% on Wednesday, rebounding from all-time lows after restrictions on insider selling expired last...","Date":1727222400000}
{"Title":null,"Date":1727222400000}
{"Title":"Investing.com -- Mizuho analysts said in a note Wednesday that Nvidia (NASDAQ:NVDA) shares surged 5%, adding $13 billion to its market capitalization, and they believe it is due to...","Date":1727222400000}
{"Title":"In a significant transaction, Mark Stevens, a director of  Nvidia Corp  (NASDAQ:NVDA), has sold a considerable amount of company stock, according to a recent regulatory filing. The...","Date":1727308800000}
{"Title":"By Echo Wang (Reuters) -The S&P 500 scored a record closing high and the Dow and Nasdaq rose on Thursday, as Micron Technology (NASDAQ:MU) shares rallied and a strong U.S. jobless...","Date":1727308800000}
{"Title":"By Arsheeya Bajwa (Reuters) -Micron Technology surged more than 13% on Thursday, after its first-quarter revenue forecast indicated strong demand and pricing for the...","Date":1727308800000}
{"Title":null,"Date":1727308800000}
{"Title":"Investing.com -- David Tepper, founder of Appaloosa Management, advised caution when it comes to buying the dip in Nvidia (NASDAQ:NVDA) stock, citing uncertainty in the long-term...","Date":1727308800000}
{"Title":"By Isla Binnie NEW YORK (Reuters) - Investors who manage hundreds of billions of dollars are pressing Microsoft (NASDAQ:MSFT), Alphabet (NASDAQ:GOOGL) and others for more...","Date":1727308800000}
{"Title":"By Krystal Hu and Kenrick Cai (Reuters) - Thrive Capital is investing more than $1 billion of OpenAI's current $6.5 billion fundraising round, and it has a sweetener no other...","Date":1727395200000}
{"Title":"By Suzanne McGee (Reuters) - Assets in actively managed exchange-traded funds (ETFs) worldwide hit a record $1 trillion at the end of August, according to data provider ETFGI,...","Date":1727395200000}
{"Title":null,"Date":1727395200000}
{"Title":"Investing.com -- Nvidia fell Friday as Beijing is pressuring Chinese companies to buy artificial intelligence chips that are produced in China rather Nvidia's chips as part of an...","Date":1727395200000}
{"Title":"DUBAI (Reuters) - The United Arab Emirates is strengthening its relationship with the United States, the Gulf state's foreign minister said on Friday, a sign of warmer relations...","Date":1727395200000}
{"Title":"(Reuters) -Apple has left negotiations to participate in an OpenAI funding round expected to raise about $6.5 billion, the Wall Street Journal said on Friday. The tech giant...","Date":1727481600000}
{"Title":"Tech stocks are poised for a double-digit rally by year-end, followed by an even stronger bull run in 2025, Wedbush analysts said Sunday. After spending several weeks in Asia,...","Date":1727654400000}
{"Title":"(Reuters) - TikTok's Chinese parent ByteDance plans to develop an AI model trained primarily with chips from compatriot Huawei Technologies, said three people familiar with the...","Date":1727654400000}
{"Title":"By Marc Jones LONDON (Reuters) - What a wild quarter for the markets! The yen's strongest run since the 2008 global crash, central banks swivelling at speed, oil diving, gold...","Date":1727654400000}
{"Title":"Investing.com -- Mizuho’s Asia hardware and semiconductor analysts have raised their 2025 forecast for Nvidia’s AI GPU units, anticipating stronger-than-expected growth driven by...","Date":1727654400000}
{"Title":"By Lewis Krauskopf NEW YORK (Reuters) -More stocks are participating in the S&P 500’s latest march to record highs, easing concerns over a rally that has been concentrated in a...","Date":1727654400000}
{"Title":"After-Hours Stock Movers:  Nike  (NYSE:NKE) fell 3% despite publishing first quarter EPS that topped consensus, as revenue trailed estimates. Management said its comeback will take...","Date":1727740800000}
{"Title":"In a recent transaction,  Nvidia Corp  (NASDAQ:NVDA) director Mark A. Stevens has sold a significant portion of his holdings in the company. The sale, which took place on...","Date":1727740800000}
{"Title":"Investing.com -- Morgan Stanley analysts provided their view on Nvidia (NASDAQ:NVDA)'s GB200 server rack production, noting that recent supply chain checks suggest no further...","Date":1727740800000}
{"Title":"TAIPEI (Reuters) - Foxconn, the world's largest contract electronics maker, said on Tuesday that executives from companies including Nvidia (NASDAQ:NVDA), Google (NASDAQ:GOOGL) and...","Date":1727740800000}
{"Title":"By Manya Saini and Pritam Biswas (Reuters) -Cerebras Systems, a startup competing with industry leader Nvidia (NASDAQ:NVDA) for a slice of the lucrative AI chip market, said late...","Date":1727740800000}
{"Title":"By Chris Taylor NEW YORK - If you followed the financial markets at all in the last 15 years, you likely know \"Downtown\" Josh Brown. The author of The Reformed Broker, one of the...","Date":1727827200000}
{"Title":null,"Date":1727827200000}
{"Title":"On Wednesday, JPMorgan expressed continued confidence in NVIDIA Corporation (NASDAQ:NVDA), maintaining an Overweight rating and a $155.00 price target on the stock. The firm's...","Date":1727827200000}
{"Title":"Investing.com -- NVIDIA Corporation (NASDAQ:NVDA) shares added 1% after hours Wednesday after CEO Jensen Huang said demand for its Blackwell product is \"insane.\" \"Blackwell is in...","Date":1727827200000}
{"Title":"By Caroline Valetkevitch NEW YORK (Reuters) - The S&P 500 ended little changed on Wednesday, with technology shares gaining but investors nervous about Middle East tensions and...","Date":1727827200000}
{"Title":"By Krystal Hu (Reuters) -OpenAI, the company behind ChatGPT, has raised $6.6 billion from investors, which could value the company at $157 billion and cement its position as one...","Date":1727913600000}
{"Title":"Investing.com -- Bank of America (BofA) analysts reiterated a Buy rating for AMD (NASDAQ:AMD) stock ahead of the company's “Advancing AI” event scheduled for October 10. Analysts...","Date":1727913600000}
{"Title":"Investing.com -- Fewer positive earnings surprises are expected in the third quarter for technology stocks, according to analysts at Citi. In a note to clients on late Thursday,...","Date":1728000000000}
{"Title":"(Reuters) - The U.S. Supreme Court is set on Monday to begin its new nine-month term that has cases on issues including guns, gender-affirming medical care for transgender minors,...","Date":1728000000000}
{"Title":"(Reuters) - Citron Capital founder and short seller Andrew Left has asked a judge to dismiss the lawsuit by the U.S. Securities and Exchange Commission that has accused him of...","Date":1728000000000}
{"Title":"Investing.com -- The trajectory of the AI semiconductor ecosystem is marked by an evolving landscape, driven by the burgeoning demand for computational power needed to fuel...","Date":1728172800000}
{"Title":"By Hyunjoo Jin SEOUL (Reuters) - Samsung Electronics (KS:005930) is expected to flag more than a four-fold jump in quarterly profit on Tuesday on improving demand for chips, but...","Date":1728172800000}
{"Title":"(Reuters) -The U.S. Supreme Court begins on Monday its new nine-month term that brings cases involving guns, gender-affirming medical care for transgender minors, online...","Date":1728259200000}
{"Title":null,"Date":1728259200000}
{"Title":"On Monday, Citi reaffirmed its Buy rating on NVIDIA Corporation (NASDAQ:NVDA) with a consistent price target of $150.00. The firm's outlook is based on a projection of strong...","Date":1728259200000}
{"Title":"(Reuters) -Super Micro Computer said on Monday it is currently shipping more than 100,000 graphics processors per quarter and unveiled a new suite of liquid cooling products,...","Date":1728259200000}
{"Title":"TAIPEI (Reuters) -Taiwan's Foxconn, the world's largest contract electronics maker, beat expectations to post its highest-ever revenue for the third quarter on strong demand for...","Date":1728259200000}
{"Title":"By Sinéad Carew and Lisa Pauline Mattackal (Reuters) -Wall Street's three major indexes closed down around 1% on Monday while Treasury yields rose, as traders tamped down bets for...","Date":1728259200000}
{"Title":"By Yimou Lee TAIPEI (Reuters) -Foxconn is building in Mexico the world's largest manufacturing facility for bundling Nvidia (NASDAQ:NVDA)'s GB200 superchips, a key component of...","Date":1728345600000}
{"Title":"Investing.com -- Nvidia (NASDAQ:NVDA) shares could see a boost as Taiwan's export data suggests stronger-than-expected demand for the chipmaker's data center products, despite a...","Date":1728345600000}
{"Title":"AT&T (NYSE:T), Lowe's (NYSE:LOW), University of Florida Among First Organizations Using NVIDIA NeMoAccenture (NYSE:ACN), Deloitte, Quantiphi, SoftServe Tap NVIDIA NeMo, NIM...","Date":1728345600000}
{"Title":"Investing.com -- NVIDIA (NASDAQ:NVDA)'s next-generation Blackwell AI chip is poised for a strong ramp-up, with production revenue in 1Q25 likely to surpass the company's current...","Date":1728345600000}
{"Title":null,"Date":1728345600000}
{"Title":"Investing.com -- Analysts at Citi have been on the road marketing in Boston and Europe, where they discussed with investors key topics regarding the Nvidia (NASDAQ:NVDA)...","Date":1728345600000}
{"Title":"AI behemoth NVIDIA's (NASDAQ:NVDA) stock is breaking out and could be heading to its June high of around $141 per share, according to technical analyst Katie Stockton of Fairlead...","Date":1728432000000}
{"Title":"Investing.com -- The S&P 500 closed higher Wednesday as investors continued to digest clues on interest rates from the Federal Reserve, a day ahead of fresh inflation data and...","Date":1728432000000}
{"Title":null,"Date":1728518400000}
{"Title":"Nvidia (NASDAQ:NVDA)'s October 2024 AI Summit provided valuable insights into the company's advancements in AI, with key updates on its Blackwell system, AI model performance...","Date":1728518400000}
{"Title":"Investing.com -- AMD (NASDAQ:AMD) is set to host its \"Advancing AI\" event this week, where analysts expect to hear about new product announcements that could lift sales and drive...","Date":1728518400000}
{"Title":"By Max A. Cherney SAN FRANCISCO (Reuters) -Advanced Micro Devices said on Thursday it plans to start mass production of a new version of its artificial-intelligence chip called...","Date":1728518400000}
{"Title":"By Norihiko Shirouzu, Chris Kirkham (Reuters) -Tesla aims to stun investors Thursday night with its long-awaited “robotaxi unveil,\" a potential milestone after a decade of Elon...","Date":1728518400000}
{"Title":"By Max A. Cherney SAN FRANCISCO (Reuters) - German industrial giant Bosch will collaborate with U.S. chip startup Tenstorrent to develop a platform for standardizing the building...","Date":1728518400000}
{"Title":"In a recent transaction,  Nvidia Corp  (NASDAQ:NVDA) director Mark A. Stevens has sold a significant portion of his holdings in the company. The sale, which took place on October...","Date":1728604800000}
{"Title":"Investing.com -- In a note Friday, Bank of America analysts highlighted Broadcom (NASDAQ:AVGO)'s promising position in the AI space, projecting a significant long-term...","Date":1728604800000}
{"Title":null,"Date":1728604800000}
{"Title":"Investing.com -- Goldman Sachs raised its price target for Nvidia (NASDAQ:NVDA) to $150 from $135 per share in a note Friday, reflecting an 11% potential upside. The investment...","Date":1728604800000}
{"Title":"Investing.com -- AMD (NASDAQ:AMD) announced on Thursday that it will begin mass production of its new MI325X AI chip in Q4, as it looks to expand its footprint in a market...","Date":1728604800000}
{"Title":"Investing.com -- Here are the biggest analyst moves in the area of artificial intelligence (AI) for this week. InvestingPro subscribers always get first dibs on market-moving AI...","Date":1728777600000}
{"Title":"U.Today - \"If you want to win, you need a Bitcoin strategy\" — that's how Michael Saylor, the CEO of MicroStrategy and one of the main players in the crypto market, titled his...","Date":1728777600000}
{"Title":"(Reuters) - U.S. officials have discussed limiting sales of advanced AI chips from Nvidia (NASDAQ:NVDA) and other American companies on a country-specific basis, Bloomberg News...","Date":1728864000000}
{"Title":"Investing.com-- The Biden administration is weighing a limit on sales of artificial intelligence chips made by NVIDIA Corporation (NASDAQ:NVDA) and AMD (NASDAQ:AMD) on a...","Date":1728864000000}
{"Title":"US Weighs Capping Nvidia (NASDAQ:NVDA), Amd Ai Chip Sales To Some Countries - Bloomberg","Date":1728864000000}
{"Title":"By David French (Reuters) -Wall Street ended higher on Monday, with both the S&P 500 and the Dow posting fresh record finishes, as investors bought into technology stocks ahead of...","Date":1728864000000}
{"Title":"Investing.com -- Reports over the weekend suggested that NVIDIA (NASDAQ:NVDA)'s DGX B200 system is being priced significantly higher than its predecessor, indicating a potential...","Date":1728864000000}
{"Title":"Investing.com -- Canaccord Genuity analysts remain optimistic about Tesla Inc (NASDAQ:TSLA)'s long-term prospects, despite growing skepticism after the company’s recent Robotaxi...","Date":1728864000000}
{"Title":"TD Cowen has expressed continued confidence in NVIDIA (NASDAQ: NVDA), maintaining a Buy rating and a $165.00 price target for the company's shares.  The firm's stance is based on...","Date":1728864000000}
{"Title":null,"Date":1728864000000}
{"Title":"On Monday, Citi reaffirmed its confidence in NVIDIA (NASDAQ:NVDA), maintaining a Buy rating and a $150.00 price target for the stock. The firm's analysis suggests a bright future...","Date":1728864000000}
{"Title":"(Reuters) -Semiconductor stocks in the United States and Asia fell after chip equipment maker ASML (AS:ASML) cut its annual sales forecast over weak non-AI chip demand while a...","Date":1728950400000}
{"Title":"By Sinéad Carew and Lisa Pauline Mattackal (Reuters) -Wall Street's major stock indexes closed lower on Tuesday, with a 1% drop in the technology-heavy Nasdaq leading losses as...","Date":1728950400000}
{"Title":"By Stephen Culp NEW YORK (Reuters) - U.S. stocks closed down on Tuesday, following world stocks lower as a weak sales forecast from chipmaker ASML (AS:ASML) weighed on tech...","Date":1728950400000}
{"Title":"By Jamie McGeever (Reuters) - A look at the day ahead in Asian markets.  Three monetary policy decisions dominate Asian markets on Wednesday, with investor sentiment and risk...","Date":1728950400000}
{"Title":"Investing.com-- U.S. stocks fell Tuesday as investors digested a series of quarterly corporate earnings, with the banking sector in the spotlight.  The Dow Jones Industrial Average...","Date":1728950400000}
{"Title":"A look at the day ahead in European and global markets from Vidya Ranganathan. Tuesday's top headlines are Wall Street's record highs overnight and Nvidia (NASDAQ:NVDA)'s fresh...","Date":1728950400000}
{"Title":"OCP Global Summit—To drive the development of open, efficient and scalable data center technologies, NVIDIA (NASDAQ:NVDA) today announced that it has contributed foundational...","Date":1728950400000}
{"Title":null,"Date":1728950400000}
{"Title":"Investing.com -- US stock futures hovered around both sides of the flatline as markets waited for cues from fresh company earnings and economic indicators. Wall Street banking...","Date":1728950400000}
{"Title":"Investing.com - European stock markets traded in a steady manner Tuesday, as investors digested regional employment and inflation data, helped by the backdrop of solid gains on...","Date":1728950400000}
{"Title":"(Reuters) -Shares of Nvidia (NASDAQ:NVDA) closed at their highest ever on Monday, putting the heavyweight AI chipmaker on the brink of dethroning Apple (NASDAQ:AAPL) as the world's...","Date":1728950400000}
{"Title":"SAN JOSE, Calif. - NVIDIA has announced its contribution of key elements of its NVIDIA Blackwell accelerated computing platform to the Open Compute Project (OCP), furthering its...","Date":1728950400000}
{"Title":"By Krystal Hu -Lightmatter, a Mountain View, California-headquartered startup building photonic tech in datacenter networking chips, said on Wednesday it has raised $400 million...","Date":1729036800000}
{"Title":"By David French (Reuters) -The Dow Jones Industrial Average rose on Wednesday and closed at a record high, and Wall Street's two other benchmark indexes also ended higher,...","Date":1729036800000}
{"Title":"By Toby Sterling and Nathan Vifflin AMSTERDAM (Reuters) -Investors and analysts are looking sceptically at computer chip equipment maker ASML (AS:ASML), they said on Wednesday,...","Date":1729036800000}
{"Title":null,"Date":1729036800000}
{"Title":"Investing.com -- The race to a $4 trillion market cap among Big Tech companies is underway, Wedbush analysts said in a Wednesday note. The investment firm believes this race will...","Date":1729036800000}
{"Title":"A look at the day ahead in U.S. and global markets from Mike Dolan World markets struggled to find a footing on Wednesday after Europe's ASML (AS:ASML) sideswiped the global chip...","Date":1729036800000}
{"Title":"ASML Holding (AS:ASML) shares plunged more than 16% Tuesday after the semiconductor equipment maker announced deep cuts to its 2025 sales forecast and reported third-quarter...","Date":1729036800000}
{"Title":"Investing.com -- US stock futures hovered around both sides of the flatline on Wednesday after a disappointing earnings report from European chipmaker ASML (AS:ASML) dragged down...","Date":1729036800000}
{"Title":"Investing.com -- US stock futures traded in a stable manner Wednesday, steadying after the previous season’s tech-inspired losses as quarterly corporate earnings continue to...","Date":1729036800000}
{"Title":"By David French (Reuters) -The Dow Jones Industrial Average advanced on Thursday to its fourth record close in the last five sessions, as stronger-than-expected monthly retail...","Date":1729123200000}
{"Title":"On Thursday, BofA Securities reaffirmed its confidence in NVIDIA (NASDAQ: NVDA), raising the price target on the stock to $190 from $165 while maintaining a Buy rating. The firm's...","Date":1729123200000}
{"Title":"Investing.com -- The S&P 500 closed slightly lower Thursday after giving up intraday gains fueled by driven by better-than-expected retail sales data and surge in chipmaking...","Date":1729123200000}
{"Title":"Investing.com - AI giant NVIDIA (NASDAQ:NVDA) tapped a new all-time of $140.89 in intra-day trading Thursday following solid results from contract chipmaker Taiwan Semiconductor...","Date":1729123200000}
{"Title":"(Reuters) -Shares of Nvidia (NASDAQ:NVDA) hit a record high amid a rally in U.S. chip stocks on Thursday after industry bellwether TSMC's strong sales forecast boosted investor...","Date":1729123200000}
{"Title":null,"Date":1729123200000}
{"Title":"Amazon (NASDAQ:AMZN) AWS Says NVIDIA (NASDAQ:NVDA) Blackwell Online Early Next Year - BloombergAmazon Says Will Have First Production Quantities Of New Chip","Date":1729123200000}
{"Title":"In a remarkable display of market confidence, Nvidia Corporation (NASDAQ:NVDA)'s stock has surged to an all-time high, reaching a price level of $140.77. This milestone...","Date":1729123200000}
{"Title":"Ljubljana, Slovenia, October 17th, 2024, Chainwire OriginTrail, the ecosystem striving for a safe internet in the age of AI with its decentralized knowledge graph, was named the...","Date":1729123200000}
{"Title":"Investing.com -- US stock index futures pointed higher on Thursday after Taiwan Semiconductor Manufacturing Co. -- the world’s biggest contract chipmaker -- posted a...","Date":1729123200000}
{"Title":"Investing.com -- Chip stocks rose higher Thursday after a blowout earnings report by Taiwan Semiconductor Manufacturing (NYSE:TSM), the world’s largest producer of advanced...","Date":1729123200000}
{"Title":"Investing.com -- Taiwan Semiconductor Manufacturing Co. (NYSE:TSM) -- the world’s biggest contract chipmaker -- posted a stronger-than-expected third quarter profit on...","Date":1729123200000}
{"Title":"By Kevin Buckland A look at the day ahead in European and global markets from Kevin Buckland China is very much the center of attention today, following a barrage of data and...","Date":1729209600000}
{"Title":"On Friday, B.Riley changed its stance on  Coherent  (NYSE:COHR), moving the stock from a Buy to a Neutral rating, while maintaining a price target of $86.00. The firm noted that...","Date":1729209600000}
{"Title":"By Lewis Krauskopf NEW YORK (Reuters) - U.S. semiconductor companies will get a closer look from investors in coming weeks, after diverging reports from two industry leaders...","Date":1729209600000}
{"Title":"Investing.com -- Bank of America analysts on Thursday reiterated a Buy rating on Nvidia (NASDAQ:NVDA) stock and lifted the price target from $165 to $190, implying nearly 40%...","Date":1729209600000}
{"Title":"Investing.com -- US stock futures edged higher Friday, as investors digested a deluge of quarterly corporate earnings. Here are some of the biggest premarket US stock movers...","Date":1729209600000}
{"Title":"By Carolina Mandl NEW YORK (Reuters) - Global hedge funds this week bought U.S. information technology stocks, such as semiconductors and hardware, at the fastest in five months...","Date":1729209600000}
{"Title":"Investing.com -- It was another busy week of market moves. Given earnings season is underway, we can expect it to get even more hectic. Here are Investing.com's stocks of the...","Date":1729296000000}
{"Title":"Investing.com -- Here are the biggest analyst moves in the area of artificial intelligence (AI) for this week. InvestingPro subscribers always get first dibs on market-moving AI...","Date":1729382400000}
{"Title":"By Lewis Krauskopf NEW YORK (Reuters) -U.S. semiconductor companies will get a closer look from investors in coming weeks, after diverging reports from two industry leaders abroad...","Date":1729382400000}
{"Title":"By Alexander Marrow (Reuters) -Amsterdam-based Nebius Group closed 5.6% higher on Monday, recovering from huge early losses when trading for the first time since February 2022, as...","Date":1729468800000}
{"Title":"Investing.com -- AI-darling NVIDIA's (NASDAQ:NVDA) stock closed at another new all-time high on Monday as it continued its meteoric rise.  The stock closed up 4.14% to $143.71 and...","Date":1729468800000}
{"Title":"Investing.com -- Wedbush analysts are forecasting a strong third-quarter tech earnings season, driven by solid enterprise spending, and a rebound in digital advertising. The firm...","Date":1729468800000}
{"Title":"(Reuters) -  IBM  (NYSE:IBM) released the latest version of its artificial intelligence models catered towards businesses on Monday, looking to capitalize on the surge in...","Date":1729468800000}
{"Title":"By Suzanne McGee (Reuters) - Investors are leaving exchange-traded funds tied to specific themes, such as artificial intelligence and video gaming, as they flock to funds linked...","Date":1729555200000}
{"Title":"LONDON (Reuters) -The CEO of leading computer chip equipment maker ASML (AS:ASML) said on Tuesday he expects that 2026 will be a growth year for the company and that the U.S....","Date":1729555200000}
{"Title":"Investing.com -- Dow futures and Nasdaq futures both inched down on Tuesday ahead of a slew of fresh quarterly earnings reports from several major companies. Texas Instruments...","Date":1729555200000}
{"Title":"TORONTO, Oct.  22, 2024  (GLOBE NEWSWIRE) -- Purpose Investments Inc. (Purpose) announced today that it has changed the risk rating for NVIDIA (NASDAQ:NVDA) Yield Shares Purpose...","Date":1729555200000}
{"Title":"By Lisa Pauline Mattackal, Purvi Agarwal and Carolina Mandl (Reuters) -U.S. stocks ended little changed on Tuesday, but the Nasdaq eked out a modest gain while investors kept an...","Date":1729555200000}
{"Title":"(Reuters) - The European Union lags far behind the United States and China in investing in artificial intelligence, the CEO of AI chipmaker Nvidia (NASDAQ:NVDA) said on Wednesday....","Date":1729641600000}
{"Title":"COPENHAGEN - Denmark has launched a new artificial intelligence supercomputer named Gefion, in a significant move to advance its capabilities in quantum computing, clean energy,...","Date":1729641600000}
{"Title":"By Jacob Gronholt-Pedersen and Supantha Mukherjee COPENHAGEN\/STOCKHOLM (Reuters) - Nvidia (NASDAQ:NVDA) CEO Jensen Huang said on Wednesday a design flaw with its latest Blackwell...","Date":1729641600000}
{"Title":"By Stephen Nellis (Reuters) - Hugging Face on Wednesday said it is releasing a new open-source software offering with Amazon.com (NASDAQ:AMZN), Alphabet (NASDAQ:GOOGL)'s Google...","Date":1729641600000}
{"Title":"By Nora Eckert and David Shepardson DETROIT (Reuters) - Leaders from American automakers and their suppliers said at a Reuters event in Detroit this week that the industry cannot...","Date":1729641600000}
{"Title":"Investing.com-- South Korea’s  SK Hynix Inc  (KS:000660) on Thursday clocked a stronger-than-expected third-quarter profit as the memory chip giant saw strong sales of its advanced...","Date":1729641600000}
{"Title":"By Lisa Pauline Mattackal, Purvi Agarwal and Carolina Mandl (Reuters) -The Nasdaq and the S&P 500 gained on Thursday, driven by Tesla (NASDAQ:TSLA)'s positive earnings forecast...","Date":1729728000000}
{"Title":"By Nick Carey (Reuters) - U.S. self-driving truck firm Outrider said on Thursday it had raised $62 million from investors to scale up autonomous truck services in distribution...","Date":1729728000000}
{"Title":"By Arsheeya Bajwa and Deborah Mary Sophia MUMBAI (Reuters) -Nvidia will supply artificial intelligence processors to Indian companies such as Mukesh Ambani's Reliance Industries,...","Date":1729728000000}
{"Title":"Investing.com -- The biggest threat to the S&P 500 bull market is not a US recession, but Japan’s deeply negative real rates relative to the US, according to BCA Research...","Date":1729728000000}
{"Title":"Investing.com -- US stock futures point mostly higher following a day of declines on Wednesday that was marked by rising yields and falling megacap tech shares. Tesla (NASDAQ:TSLA)...","Date":1729728000000}
{"Title":"By Arsheeya Bajwa MUMBAI (Reuters) - Nvidia (NASDAQ:NVDA)'s leather-jacket-clad CEO Jensen Huang got a rock star welcome at the company's AI summit in India on Thursday, with...","Date":1729728000000}
{"Title":"U.Today - As Microsoft (NASDAQ:MSFT) shareholders look forward to their Dec. 10 meeting, many intrigues have begun manifesting in the broader cryptocurrency space. Michael Saylor,...","Date":1729814400000}
{"Title":"By Sruthi Shankar and Noel Randewich (Reuters) -Nvidia dethroned Apple (NASDAQ:AAPL) as the world's most valuable company on Friday following a record-setting rally in the stock,...","Date":1729814400000}
{"Title":"By Lisa Pauline Mattackal, Purvi Agarwal and Carolina Mandl (Reuters) -The Nasdaq ended higher on Friday, driven by megacap shares, as investors awaited quarterly results from...","Date":1729814400000}
{"Title":null,"Date":1729900800000}
{"Title":"Investing.com -- Here are the biggest analyst moves in the area of artificial intelligence (AI) for this week. InvestingPro subscribers always get first dibs on market-moving AI...","Date":1729987200000}
{"Title":"(This Oct. 26 story has been refiled to fix the name of the Research Institute for Democracy, Society and Emerging Technology in paragraph 13) By Karen Freifeld and Fanny Potkin...","Date":1729987200000}
{"Title":"By Abigail Summerville (Reuters) -Wall Street closed higher on Monday ahead of a packed week of earnings from megacap companies and the final stretch before the Nov. 5...","Date":1730073600000}
{"Title":"SANTA CLARA, Calif. - NVIDIA has announced that its Spectrum-X Ethernet networking platform is integral to the massive scale of xAI's Colossus supercomputer cluster, which is...","Date":1730073600000}
{"Title":"By Max A. Cherney SAN FRANCISCO (Reuters) - Startup Untether launched an artificial intelligence chip on Monday that aims to power AI applications in cars, agricultural devices...","Date":1730073600000}
{"Title":"NVIDIA (NASDAQ:NVDA) oday announced that xAI’s Colossus supercomputer cluster comprising 100,000 NVIDIA Hopper Tensor Core GPUs in Memphis, Tennessee, achieved this massive scale...","Date":1730073600000}
{"Title":"Investing.com -- Investors are looking ahead to a busy week of key economic figures and quarterly returns from several megacap technology stocks. So far this year, the S&P 500 has...","Date":1730073600000}
{"Title":null,"Date":1730073600000}
{"Title":"Investing.com -- The Nasdaq Composite rose to a record high on Friday, driven by gains in large-cap technology stocks. The index climbed 0.56%, closing at 18,518.61. Meanwhile, the...","Date":1730073600000}
{"Title":"Investing.com -- Stock futures on Wall Street rose on Monday ahead of a busy week highlighted by key earnings, monthly nonfarm payrolls figures, and the final frantic days of...","Date":1730073600000}
{"Title":"TAIPEI (Reuters) - Economic growth in trade-dependent Taiwan was expected to slow in the third quarter with exports still robust on AI demand but moderating, while domestic...","Date":1730073600000}
{"Title":"By Suzanne McGee (Reuters) - Exchange-traded funds focused on artificial intelligence are proliferating as asset managers offer investors new ways to tap in to the market...","Date":1730073600000}
{"Title":"By Stephen Nellis (Reuters) - A bipartisan group of U.S. lawmakers on Monday urged the Department of Commerce to examine national security threats from China's development of...","Date":1730073600000}
{"Title":"By Abigail Summerville (Reuters) - The Nasdaq scored a record closing high and the S&P 500 rose on Tuesday, while the Dow fell as investors digested a host of corporate earnings...","Date":1730160000000}
{"Title":"By Jamie McGeever ORLANDO, Florida (Reuters) -With just over two months left in 2024, the S&P 500 is poised to post its biggest annual gain this century. Whether it achieves this...","Date":1730160000000}
{"Title":"Investing.com -- Softbank (OTC:SFTBY) CEO Masayoshi Son said Tuesday that he is focused squarely on realizing artificial super intelligence and sees hundreds of billions of dollars...","Date":1730160000000}
{"Title":"By Ben Blanchard and Yimou Lee TAIPEI (Reuters) -A senior U.S. diplomat who helps manage ties with Taiwan has arrived in Taipei, the de facto U.S. embassy said on Tuesday, as...","Date":1730160000000}
{"Title":"A look at the day ahead in European and global markets from Kevin Buckland Earnings are very much front and centre on Tuesday, particularly with markets mostly treading water as a...","Date":1730160000000}
{"Title":null,"Date":1730160000000}
{"Title":"Investing.com --- Google parent Alphabet (NASDAQ:GOOGL) highlighted with its third quarter earnings report Tuesday night that it spent $13.1 billion on capex in the quarter, up 62%...","Date":1730246400000}
{"Title":"By Krystal Hu, Fanny Potkin and Stephen Nellis (Reuters) - OpenAI is working with Broadcom (NASDAQ:AVGO) and TSMC to build its first in-house chip designed to support its...","Date":1730246400000}
{"Title":"SANTA CLARA, Calif., Oct.  30, 2024  (GLOBE NEWSWIRE) -- NVIDIA will host a conference call on Wednesday, November 20, at 2 p.m.  PT (5 p.m. ET) to discuss its financial results...","Date":1730246400000}
{"Title":"By Foo Yun Chee BRUSSELS (Reuters) -U.S. chipmaker Nvidia (NASDAQ:NVDA) will have to seek EU antitrust clearance for its proposed acquisition of AI startup Run:ai because it...","Date":1730332800000}
{"Title":"(Reuters) - OpenAI on Thursday added a set of new search functions to its popular large language model ChatGPT, opting to integrate the feature into the chatbot instead of...","Date":1730332800000}
{"Title":"By Abigail Summerville (Reuters) -All three U.S. stock indexes closed lower on Thursday after Microsoft (NASDAQ:MSFT) and Meta Platforms (NASDAQ:META) highlighted growing...","Date":1730332800000}
{"Title":"ZURICH (Reuters) -The Swiss National Bank (SNB) made a profit of 5.67 billion Swiss francs ($6.55 billion) in the third quarter, it said on Thursday, helped by a big rise in the...","Date":1730332800000}
{"Title":"By Yimou Lee and Ben Blanchard TAIPEI (Reuters) -A strong Typhoon Kong-rey made landfall on Taiwan's east coast on Thursday, the largest storm by size to hit the island in nearly...","Date":1730332800000}
{"Title":"Investing.com -- US stock futures edge lower as traders gauge quarterly reports from major technology groups. Both Microsoft (NASDAQ:MSFT) and Meta Platforms (NASDAQ:META) post...","Date":1730332800000}
{"Title":"TAIPEI (Reuters) - Taiwan's trade-dependent economy grew more than expected in the third quarter of 2024, thanks to stronger demand for new applications such as artificial...","Date":1730332800000}
{"Title":"A look at the day ahead in European and global markets from Kevin Buckland Mega-tech earnings remain in the spotlight on Thursday, particularly after the Bank of Japan's...","Date":1730332800000}
{"Title":"By Heekyong Yang and Hyunjoo Jin SEOUL (Reuters) -Samsung Electronics said it would focus on producing high-end chips and was making progress on a major supply deal, as it sought...","Date":1730332800000}
{"Title":"Investing.com --- AI server maker Super Micro Computer Inc (NASDAQ:SMCI) plunged 33% on Wednesday and is down another 12% today after the company disclosed that its registered...","Date":1730332800000}
{"Title":null,"Date":1730419200000}
{"Title":"By Arsheeya Bajwa (Reuters) -Intel will be replaced by Nvidia (NASDAQ:NVDA) on the blue-chip Dow Jones Industrial Average index after a 25-year run, underscoring the shift in the...","Date":1730419200000}
{"Title":"By Abigail Summerville (Reuters) - Wall Street's major indexes ended higher on Friday, rebounding from the previous day's sell-off as Amazon's strong earnings countered a...","Date":1730419200000}
{"Title":"After the close of trading on Friday, S&P Dow Jones Indices announced that AI giant NVIDIA Corporation (NASDAQ:NVDA) will replace Intel Corporation (NASDAQ:INTC) in the Dow Jones...","Date":1730419200000}
{"Title":"During the whirlwind AI boom over the past nearly two years, when market watchers think of AI servers, they think of NVIDIA (NASDAQ:NVDA) and Super Micro Computer (NASDAQ:SMCI)....","Date":1730419200000}
{"Title":"By Jeffrey Dastin (Reuters) -Intel's upbeat revenue projections on Thursday masked a sore point for the embattled company: chips touted for artificial intelligence have not lived...","Date":1730419200000}
{"Title":"Investing.com -- Jefferies on Thursday unveiled the latest hedge fund portfolio updates, highlighting that Amazon (NASDAQ:AMZN) retains its position as the largest net weight. As...","Date":1730419200000}
{"Title":"By Max A. Cherney and Arsheeya Bajwa (Reuters) -Intel expressed optimism on Thursday about the future of its PC and server businesses, forecasting current-quarter revenue above...","Date":1730419200000}
{"Title":"By Anna Tong, Aditya Soni and Deborah Mary Sophia (Reuters) -Big technology companies including Microsoft (NASDAQ:MSFT), Meta (NASDAQ:META) and Amazon (NASDAQ:AMZN) are stepping...","Date":1730419200000}
{"Title":"By Caroline Valetkevitch NEW YORK (Reuters) - Global stock indexes climbed on Friday with Amazon.com (NASDAQ:AMZN) shares rallying following the company's stronger-than-expected...","Date":1730419200000}
{"Title":"(Reuters) - Physical Intelligence, a startup that is developing foundational software for robots, said on Monday it has raised $400 million in early-stage funding from Amazon...","Date":1730678400000}
{"Title":"Investing.com -- Hyperscalers like Alphabet (NASDAQ:GOOGL), Microsoft (NASDAQ:MSFT), Amazon.com (NASDAQ:AMZN), and Meta (NASDAQ:META) reported their third-quarter financial results...","Date":1730678400000}
{"Title":"By Chuck Mikolajczak NEW YORK (Reuters) -U.S. stocks closed slightly lower after a choppy session on Monday, as investors prepared for a crucial week in which Americans will elect...","Date":1730678400000}
{"Title":"Investing.com-- The S&P 500 closed lower Monday as traders opted for caution ahead of the presidential election and the Federal Reserve's rate decision later this week.  At 4:00...","Date":1730678400000}
{"Title":"By John Kruzel WASHINGTON (Reuters) - The U.S. Supreme Court is set to consider bids by two tech giants - Meta's Facebook (NASDAQ:META) and Nvidia (NASDAQ:NVDA) - to fend off...","Date":1730678400000}
{"Title":"By Hyunjoo Jin and Joyce Lee SEOUL (Reuters) - Nvidia (NASDAQ:NVDA) CEO Jensen Huang had asked memory chip maker SK Hynix to bring forward by six months the supply of its...","Date":1730678400000}
{"Title":"Investing.com -- US stock futures edged higher Monday, at the start of a week that includes a tightly-fought presidential election, a Federal Reserve policy meeting and more...","Date":1730678400000}
{"Title":"(Reuters) - Nvidia (NASDAQ:NVDA) led a surge in market value among global firms in October, buoyed by unrelenting demand for its new supercomputing artificial intelligence chips...","Date":1730678400000}
{"Title":"By Aditya Kalra and Kane Wu NEW DELHI\/HONG KONG (Reuters) - Indian billionaire Mukesh Ambani targets a 2025 Mumbai listing for his telecom business Jio, valued by analysts at over...","Date":1730678400000}
{"Title":"Investingcom -- Nvidia (NASDAQ:NVDA) CEO Jensen Huang has urged SK Hynix to expedite production of its next-generation high-bandwidth memory chips, known as HBM4, SK Group...","Date":1730678400000}
{"Title":"Investing.com -- Markets are on edge ahead of the upcoming US presidential election on Tuesday, with analysts indicating that the outcome could significantly impact the market...","Date":1730678400000}
{"Title":"Investing.com -- AI server maker Super Micro Computer Inc (NASDAQ:SMCI) is volatile again Monday as it continues to suffer from the news last week that its auditor is resigning. ...","Date":1730678400000}
{"Title":"Investing.com -- Super Micro Computer Inc (NASDAQ:SMCI) has been under intense pressure over the last few months related to a short seller report, delayed financial filings, the...","Date":1730764800000}
{"Title":"Investing.com -- The outlook beyond October for the \"Magnificent Seven\" stocks, a group consisting of leading US tech giants, is growing increasingly uncertain, according to BCA...","Date":1730764800000}
{"Title":"Investing.com -- Nvidia (NASDAQ:NVDA) stock is “set up well to sustain its outperformance,” according to Goldman Sachs analysts, noting that demand for AI-driven compute solutions...","Date":1730851200000}
{"Title":"Investing.com --  Mizuho  (NYSE:MFG) has added Nvidia (NASDAQ: NASDAQ:NVDA) as a new top pick for November, underscoring its strong position in the AI and data center...","Date":1730851200000}
{"Title":"By John Kruzel WASHINGTON (Reuters) -The U.S. Supreme Court grappled on Wednesday over a bid by Meta's Facebook (NASDAQ:META) to scuttle a federal securities fraud lawsuit brought...","Date":1730851200000}
{"Title":"By Jaspreet Singh (Reuters) - Perplexity is raising new investment that would value the search startup at $9 billion, a source familiar with the matter said on Tuesday, a sign of...","Date":1730851200000}
{"Title":"By Max A. Cherney, Deborah Mary Sophia SAN FRANCISCO (Reuters) -Chip designer  Arm  Holdings (NASDAQ:ARM) on Wednesday forecast revenue in line with Wall Street targets, sparking...","Date":1730851200000}
{"Title":"SANTA CLARA, CA - NVIDIA Corporation (NASDAQ:NVDA) has announced the appointment of Dr. Ellen Ochoa to its Board of Directors, effective today. With Dr. Ochoa's appointment, the...","Date":1730937600000}
{"Title":"By Noel Randewich (Reuters) - Shares of Nvidia (NASDAQ:NVDA) rallied to a record high on Thursday, making the chipmaker the first company in history to surpass a stock market...","Date":1730937600000}
{"Title":"SANTA CLARA, Calif. - NVIDIA Corporation (NASDAQ: NASDAQ:NVDA), a leader in accelerated computing, announced today the appointment of Ellen Ochoa, the first Latina astronaut and...","Date":1730937600000}
{"Title":"(Reuters) -Qualcomm shares rose 4% on Thursday after the chip designer's strong quarterly revenue forecast fanned investor optimism about a China-led recovery in the smartphone...","Date":1730937600000}
{"Title":"NVIDIA (NASDAQ:NVDA) today announced that it has named to its board of directors Ellen Ochoa, who was the former director of NASA’s Johnson Space Center in Houston, and the first...","Date":1730937600000}
{"Title":"TAIPEI (Reuters) - Taiwan's exports rose less than expected in October, as benefits from the booming artificial intelligence (AI) industry were countered by the sluggish economy...","Date":1731024000000}
{"Title":"By Lisa Pauline Mattackal and Ankika Biswas (Reuters) -The S&P 500 briefly touched the psychologically significant 6,000 mark for the first time on Friday, building on a sharp...","Date":1731024000000}
{"Title":"By Karen Freifeld and Fanny Potkin NEW YORK\/SINGAPORE (Reuters) -The U.S. ordered Taiwan Semiconductor Manufacturing Co to halt shipments of advanced chips to Chinese customers...","Date":1731196800000}
{"Title":"Investing.com -- Here are the biggest analyst moves in the area of artificial intelligence (AI) for this week. InvestingPro subscribers always get first dibs on market-moving AI...","Date":1731196800000}
{"Title":"(Refiles unchanged to fix format issues) By Krystal Hu, Anna Tong (Reuters) -Artificial intelligence companies like OpenAI are seeking to overcome unexpected delays and challenges...","Date":1731283200000}
{"Title":"Investing.com --  Morgan Stanley  (NYSE:MS) raised its Nvidia (NASDAQ:NVDA) stock estimates ahead of the company’s earnings report next week. Despite supply constraints, the firm...","Date":1731283200000}
{"Title":"On Monday,  Mizuho  (NYSE:MFG) maintained its Outperform rating on NVIDIA (NASDAQ:NVDA) and increased the price target to $165 from $140. The firm anticipates an in-line guidance...","Date":1731283200000}
{"Title":null,"Date":1731283200000}
{"Title":"On Monday, UBS has updated its outlook on NVIDIA (NASDAQ:NVDA), increasing the price target to $185.00, up from the previous $150.00, while reiterating a Buy rating for the stock....","Date":1731283200000}
{"Title":"On  Monday  (NASDAQ:MNDY),  Morgan Stanley  (NYSE:MS) maintained its Overweight rating on NVIDIA (NASDAQ: NASDAQ:NVDA), while increasing the price target from $150.00 to $160.00....","Date":1731283200000}
{"Title":"NVIDIA (NASDAQ:NVDA) falls to low, down 2.7%NVDA falls amid weakness in semiconductors stocks. Direxion Daily Semiconductor Bull 3x Shares (SOXL) -9.6%","Date":1731283200000}
{"Title":"Investing.com - Earnings growth will likely be a key future driver of US equities, although possible policy shifts during the upcoming Trump administration could impact the outlook...","Date":1731283200000}
{"Title":"On  Monday  (NASDAQ:MNDY), an analyst from Melius increased the price target on NVIDIA (NASDAQ:NVDA) shares to $185.00 from the previous $165.00 while maintaining a \"Buy\" rating....","Date":1731283200000}
{"Title":"SHANGHAI (Reuters) - China's semiconductor index leapt close to a three-year high on  Monday  (NASDAQ:MNDY) on bets a U.S. order halting Taiwan Semiconductor Manufacturing Co's...","Date":1731283200000}
{"Title":"On  Monday  (NASDAQ:MNDY), Piper Sandler maintained an Overweight rating on NVIDIA (NASDAQ:NVDA) shares and increased the price target to $175 from the previous $140. The...","Date":1731283200000}
{"Title":"Investing.com - Nvidia (NASDAQ:NVDA) is \"well-positioned\" to capture most of the expected growth in the market for specialized artificial intelligence-enhancing hardware in 2025,...","Date":1731283200000}
{"Title":"NVIDIA (NASDAQ:NVDA) today announced a series of collaborations with SoftBank Corp. designed to accelerate Japan’s sovereign AI initiatives and further its global technology...","Date":1731369600000}
{"Title":"TOKYO, Nov.  12, 2024  (GLOBE NEWSWIRE) -- NVIDIA AI Summit Japan”NVIDIA today announced that Japan cloud leaders SoftBank (TYO:9984) Corp., GMO Internet Group, Highreso, KDDI...","Date":1731369600000}
{"Title":"SoftBank (TYO:9984) Building Nation's Most Powerful AI Supercomputer With NVIDIA Blackwell for Wide Range of Sovereign AI Initiatives, Announces Plans for Grace BlackwellNVIDIA AI...","Date":1731369600000}
{"Title":null,"Date":1731369600000}
{"Title":"By Sinéad Carew and Lisa Pauline Mattackal (Reuters) -Wall Street's three major indexes closed lower on Tuesday as investors booked some profits from a post-election rally and...","Date":1731369600000}
{"Title":"Investing.com -- Nvidia (NASDAQ:NVDA) is due to report earnings for the October quarter on November 20, with Citi expecting a “smaller ‘beat & raise’” due to the ongoing Blackwell...","Date":1731369600000}
{"Title":"On Tuesday, Citi expressed a positive outlook on the U.S. semiconductor sector, indicating that the recent downturn is nearing its end and suggesting that it may soon be an...","Date":1731369600000}
{"Title":"Investing.com - Accelerated computing power and demand from enterprise, government and cloud service providers are both due to drive growth at artificial intelligence-darling...","Date":1731369600000}
{"Title":"Investing.com -- Citi analysts believe the recent downturn in semiconductor stocks is nearing its end and now it is \"almost time to buy again,\" citing the promising outlook for...","Date":1731369600000}
{"Title":"Investing.com - Nvidia (NASDAQ:NVDA) is due to report its latest quarterly results on Nov. 20, with investors on the lookout for any guidance from the chipmaking titan about demand...","Date":1731369600000}
{"Title":"Investing.com -- Volatility in the technology sector may rise following the latest round of chip export controls by the US, according to UBS strategists. The US has reportedly...","Date":1731369600000}
{"Title":"Investing.com -- UBS analysts said they remain bullish ahead of Nvidia’s earnings report next week, expecting the AI darling to deliver strong results and guidance that could keep...","Date":1731369600000}
{"Title":"On Tuesday, Redburn-Atlantic began coverage on shares of NVIDIA (NASDAQ:NVDA), a leading technology company known for its graphics processing units (GPUs). The firm set a Buy...","Date":1731369600000}
{"Title":"By Stephen Nellis (Reuters) - Amazon.com (NASDAQ:AMZN)'s cloud computing unit on Tuesday said it will offer free computing power to researchers who want to use its custom...","Date":1731369600000}
{"Title":"TAIPEI (Reuters) - The head of Taiwan's central bank said on Thursday that he doubted that U.S. President-elect Donald Trump's new administration would penalise Taiwan given the...","Date":1731456000000}
{"Title":"By Arsheeya Bajwa and Krystal Hu (Reuters) -AI cloud platform operator CoreWeave said on Wednesday it closed a $650 million secondary share sale to investors, a deal that a source...","Date":1731456000000}
{"Title":"By Stephen Nellis (Reuters) - California's only remaining nuclear power plant plans to use artificial intelligence tools to help it comply with new licensing requirements to keep...","Date":1731456000000}
{"Title":"In a recent congressional trade report, it was revealed that Thomas R. Suozzi, representing New York's 3rd congressional district, made several transactions involving stocks of...","Date":1731456000000}
{"Title":"(Updated - November 13, 2024 12:49 PM EST)   PG&E Corp. (PCG) Gains on Talk of Energy Deal with NVIDIA (NVDA)NVIDIA ENTERS NUCLEAR: DEAL WITH DIABLO CANYON BRINGS AI...","Date":1731456000000}
{"Title":"By Jihoon Lee and Hyunjoo Jin SEOUL (Reuters) - Shares in Samsung Electronics (KS:005930), the world's top memory chip maker, fell on Wednesday to their lowest level in more than...","Date":1731456000000}
{"Title":"By John Kruzel, Andrew Chung WASHINGTON (Reuters) -The U.S. Supreme Court scrutinized on Wednesday Nvidia (NASDAQ:NVDA)'s bid to torpedo a securities fraud lawsuit accusing the...","Date":1731456000000}
{"Title":"TAIPEI (Reuters) - Taiwan's central bank warned on Wednesday that it sees peril in the proposed trade policies of the incoming administration of U.S. President-elect Donald Trump....","Date":1731456000000}
{"Title":"TOKYO (Reuters) -SoftBank's Japanese telecoms unit will receive the first chips using Nvidia (NASDAQ:NVDA)'s latest Blackwell design for its supercomputer, the California-based...","Date":1731456000000}
{"Title":"In a recent congressional trade report, it was revealed that Thomas R. Suozzi, representing New York's 3rd congressional district, has made a significant sale in his investment...","Date":1731456000000}
{"Title":"By John Kruzel and Andrew Chung WASHINGTON (Reuters) - Republican Donald Trump's return to the presidency is expected to precipitate a shift in the U.S. government's legal stance...","Date":1731542400000}
{"Title":"On Thursday, HSBC analyst increased the price target on shares of NVIDIA (NASDAQ:NVDA) to $200 from the previous $145, while maintaining a Buy rating on the stock. The adjustment...","Date":1731542400000}
{"Title":"Investing.com -- As Nvidia (NASDAQ:NVDA) approaches another earnings report, analysts at Wedbush and  Raymond  (NS:RYMD) James are reiterating their bullish stance on the stock,...","Date":1731542400000}
{"Title":"On Thursday, Oppenheimer maintained its positive outlook on NVIDIA (NASDAQ:NVDA) shares, raising the stock's price target from $150.00 to $175.00 and keeping an Outperform...","Date":1731542400000}
{"Title":null,"Date":1731542400000}
{"Title":"On Thursday, Susquehanna maintained a positive stance on NVIDIA (NASDAQ:NVDA), raising the stock's price target from $160.00 to $180.00. The firm anticipates strong results in the...","Date":1731542400000}
{"Title":"On Thursday, Wedbush Securities adjusted its outlook on shares of NVIDIA Corporation (NASDAQ:NVDA), raising the stock's price target from $138.00 to $160.00 while maintaining an...","Date":1731542400000}
{"Title":"Investing.com - Nvidia (NASDAQ:NVDA) is due to report its latest quarterly results on Nov. 20, with investors on the lookout for any guidance from the chipmaking titan about demand...","Date":1731542400000}
{"Title":"By Yimou Lee and Faith Hung TAIPEI (Reuters) -Taiwan's  Foxconn  (SS:601138), the world's largest contract electronics maker, said on Thursday it expected robust growth in its...","Date":1731542400000}
{"Title":"(Reuters) - Chip behemoth Nvidia (NASDAQ:NVDA) is reporting quarterly results and global PMI data is rolling in as markets continue to digest the fallout from Donald Trump's U.S....","Date":1731628800000}
{"Title":"(Refiles to fix formatting, no change to content of story) By Krystal Hu and Anna Tong (Reuters) -Artificial intelligence companies like OpenAI are seeking to overcome unexpected...","Date":1731628800000}
{"Title":null,"Date":1731628800000}
{"Title":"On Friday, Jefferies, a global investment banking firm, updated its outlook on NVIDIA Corporation (NASDAQ:NVDA), raising the price target from $150.00 to $185.00. The firm has...","Date":1731628800000}
{"Title":"Investing.com -- Nvidia (NASDAQ:NVDA) is set to report earnings next week and analysts at Jefferies expect another strong quarter for the AI darling. The investment bank believes...","Date":1731628800000}
{"Title":"Investing.com – U.S. stocks were lower after the close on Friday, as losses in the Technology, Healthcare and Consumer Services sectors led shares lower._x000D_ At the close in NYSE, the...","Date":1731628800000}
{"Title":null,"Date":1731801600000}
{"Title":"(Reuters) -Nvidia's new Blackwell AI chips, which have already faced delays, have encountered problems with accompanying servers that overheat, causing some customers to worry...","Date":1731801600000}
{"Title":"Investing.com -- AI darling Nvidia is reporting quarterly results, the crypto rally rolls on, the UK is to release inflation data and oil prices look set to remain on the back...","Date":1731801600000}
{"Title":"Investing.com -- Here are the biggest analyst moves in the area of artificial intelligence (AI) for this week. InvestingPro subscribers always get first dibs on market-moving AI...","Date":1731801600000}
{"Title":"By  Lewis  (JO:LEWJ) Krauskopf NEW YORK (Reuters) -Nvidia Corp's results in the coming week could guide the U.S. stock market on its next path, as investors turn their focus to...","Date":1731801600000}
{"Title":"Investing.com-- Most Asian stocks rose on Tuesday with local technology stocks tracking overnight strength in their U.S. peers, with focus this week squarely on an interest rate...","Date":1731888000000}
{"Title":"By Abigail Summerville (Reuters) -The Nasdaq and S&P 500 closed higher on Monday, recovering some losses as investors anticipate quarterly earnings from AI leader Nvidia...","Date":1731888000000}
{"Title":"By Chibuike Oguh and Samuel Indyk NEW YORK\/LONDON (Reuters) -Global shares rose on Monday while the U.S. dollar fell but still traded near one-year highs as traders pared...","Date":1731888000000}
{"Title":"By Jamie McGeever (Reuters) - A look at the day ahead in Asian markets.  Investors in Asia will likely take their cue from global dynamics and drivers given the dearth of local...","Date":1731888000000}
{"Title":"(Reuters) - Artificial intelligence search startup Perplexity on Monday launched a shopping hub to attract users, in a bid to beef up its platform as it attempts to take on...","Date":1731888000000}
{"Title":"Investing.com -- The S&P500 closed higher Monday, underpinned by a big tech and Tesla-driven rally ahead of key earnings from chipmaker Nvidia (NASDAQ:NVDA) as well as comments...","Date":1731888000000}
{"Title":"LONDON--(BUSINESS WIRE)--nVent Electric plc (NYSE:NVT) (nVent), a global leader in electrical connection and protection solutions, today announced that it is collaborating with...","Date":1731888000000}
{"Title":"ATLANTA - NVIDIA Corporation (NASDAQ: NASDAQ:NVDA) has unveiled a new blueprint for real-time computer-aided engineering (CAE (NYSE:CAE)) digital twins, aimed at aiding developers...","Date":1731888000000}
{"Title":"NVIDIA (NASDAQ:NVDA) today announced an NVIDIA Omniverse™ Blueprint that enables industry software developers to help their computer-aided engineering (CAE) customers in aerospace,...","Date":1731888000000}
{"Title":"ATLANTA, Nov.  18, 2024  (GLOBE NEWSWIRE) -- SC24 -- NVIDIA today announced that global pharmaceutical and techbio industry leaders, academic pioneers and AI researchers are...","Date":1731888000000}
{"Title":"By Sruthi Shankar and Pranav Kashyap (Reuters) -European shares kicked off the week on a dour note, weighed down by declines in real estate stocks, while investors studied...","Date":1731888000000}
{"Title":null,"Date":1731888000000}
{"Title":"Investing.com -- Mizuho analysts raised their estimates and price target for Dell Technologies (NYSE:DELL), highlighting its increasing share in the AI server market as NVIDIA...","Date":1731888000000}
{"Title":"Investing.com -- Nvidia, the darling of the semiconductor sector and a key player in the tech rally, faces mounting challenges ahead of its highly anticipated earnings report,...","Date":1731888000000}
{"Title":"ATLANTA, Nov.  18, 2024  (GLOBE NEWSWIRE) -- SC24 -- NVIDIA today announced it is working with Google (NASDAQ:GOOGL) Quantum (NASDAQ:QMCO) AI to accelerate the design of its...","Date":1731888000000}
{"Title":"Investing.com -- US stock futures traded in a mixed fashion Monday, with traders awaiting more corporate earnings as well as speeches from a number of Fed officials.  Here are some...","Date":1731888000000}
{"Title":"A look at the day ahead in European and global markets from Wayne Cole. It's been a relatively calm start to the week for markets with the early action in currencies, as the...","Date":1731888000000}
{"Title":"Investing.com -- Nvidia's upcoming earnings report has the potential to steer the market's short-term trajectory, according to analysts at Bank of America in a note Monday. The...","Date":1731888000000}
{"Title":"Investing.com -- NVIDIA's (NASDAQ:NVDA) new Blackwell AI chip is said to be having issues with overheating when connected in customized server racks, The Information reported...","Date":1731888000000}
{"Title":"On Monday, Evercore ISI reiterated its positive stance on NVIDIA Corporation (NASDAQ:NVDA) stock, maintaining an Outperform rating and a price target of $189.00.  The firm...","Date":1731888000000}
{"Title":"Investing.com -- The U.S. equity market faces a potential pullback of 5% to 9% in the near term, according to Evercore ISI analysts on Monday, citing a combination of macroeconomic...","Date":1731888000000}
{"Title":"Investing.com -- Wall Street is seen trading in a mixed fashion Monday, as investors await the release of earnings from Nvidia, one of the main beneficiaries of this year's...","Date":1731888000000}
{"Title":"On Monday,  Morgan Stanley  (NYSE:MS) reiterated its optimistic stance on NVIDIA Corporation (NASDAQ:NVDA), maintaining an Overweight rating and a $160.00 price target. The...","Date":1731888000000}
{"Title":"Investing.com -- Stocks dropped sharply on Friday as the post-election rally lost steam and concerns over the trajectory of interest rates weighed on investor sentiment. The Dow...","Date":1731888000000}
{"Title":"On Monday, Rosenblatt Securities reaffirmed its confidence in NVIDIA Corporation (NASDAQ:NVDA), maintaining a Buy rating and a price target of $200. The firm anticipates a positive...","Date":1731888000000}
{"Title":"On Monday, Bank of America (BofA) addressed concerns surrounding NVIDIA's (NASDAQ:NVDA) next-generation Blackwell platform, specifically the high power consumption of certain...","Date":1731888000000}
{"Title":"A look at the day ahead in U.S. and global markets from Mike Dolan Wall Street feels a little bruised after its worst week in 10 spoiled the post-election party, with home truths...","Date":1731888000000}
{"Title":"BRUSSELS (Reuters) - EU antitrust regulators will make a decision on U.S. chipmaker Nvidia (NASDAQ:NVDA)'s proposed acquisition of Israeli AI startup Run:ai by Dec. 20, according...","Date":1731974400000}
{"Title":"Investing.com -- With Nvidia (NASDAQ:NVDA) set to report its latest quarterly earnings on Wednesday, November 20, Investing.com's poll this week aims to understand how investors...","Date":1731974400000}
{"Title":"Investing.com -  Samsung Electronics Co Ltd  (KS:005930) said qualification testing with Nvidia (NASDAQ:NVDA) was “progressing well” and expected its revenue high-bandwidth memory...","Date":1731974400000}
{"Title":"Investing.com -- Morgan Stanley’s analysis of large-cap institutional ownership reveals shifting dynamics in mega-cap technology stocks.  While the under-ownership of these stocks...","Date":1731974400000}
{"Title":null,"Date":1731974400000}
{"Title":"By Jamie McGeever (Reuters) - A look at the day ahead in Asian markets.  Geopolitical jitters rippled through world markets on Tuesday but subsided as the U.S. trading session...","Date":1731974400000}
{"Title":"Investing.com-- The S&P 500 closed higher Tuesday, as an Nvidia-led climb in tech helped stocks shrug off earlier concerns about increasing Russia-Ukraine tensions. At 4.00 p.m. ET...","Date":1731974400000}
{"Title":"Investing.com – U.S. stocks were mixed after the close on Tuesday, as gains in the Technology, Utilities and Consumer Services sectors led shares higher while losses in the...","Date":1731974400000}
{"Title":"By Caroline Valetkevitch NEW YORK (Reuters) -The Nasdaq rose more than 1% and S&P 500 also ended higher on Tuesday, led by a jump in technology shares as investors eagerly awaited...","Date":1731974400000}
{"Title":"Investing.com-- Asian stocks kept to a tight range on Wednesday as technology shares turned skittish before key earnings from  Nvidia Corp , while Chinese markets struggled after...","Date":1731974400000}
{"Title":"Investing.com -- Barclays analysts suggest that Nvidia (NASDAQ:NVDA)'s upcoming earnings report on November 20 is poised to be the defining market catalyst of the year, eclipsing...","Date":1731974400000}
{"Title":"By Niket Nishant, Shivansh Tiwary and Manya Saini (Reuters) - Corporate executives were taking a wait-and-see approach to President-elect Donald Trump's vow to impose heavy...","Date":1731974400000}
{"Title":"Investing.com -- Super Micro Computer Inc (NASDAQ:SMCI) shares rocketed more than 23% in premarket trading Tuesday after the AI server maker surprisingly introduced an independent...","Date":1731974400000}
{"Title":"By Arsheeya Bajwa (Reuters) -Nvidia has bested lofty Wall Street revenue expectations for the past eight quarters, but as analysts expect a slower pace of growth, how the company...","Date":1731974400000}
{"Title":"By Stephen Nellis (Reuters) - Silicon Valley startup d-Matrix on Tuesday said it is shipping its first AI chip aimed at delivering services such as chatbots and video generators....","Date":1731974400000}
{"Title":"Investing.com -- Wedbush analysts are bullish on Nvidia (NASDAQ:NVDA) ahead of its upcoming earnings report, expecting what they describe as another \"drop the mic performance\" from...","Date":1731974400000}
{"Title":"On Tuesday, KeyBanc maintained its Overweight rating on NVIDIA (NASDAQ:NVDA) stock with a steady price target of $180.00, despite anticipating mixed results in the near term.  The...","Date":1731974400000}
{"Title":"Investing.com -- Wall Street is seen slipping slightly at the open Tuesday ahead of key earnings from retail giant Walmart. Goldman Sachs looks for future equity gains, while Trump...","Date":1731974400000}
{"Title":"Investing.com -- KeyBanc Capital Markets expects Nvidia (NASDAQ:NVDA) to “solidly beat” expectations with its upcoming third-quarter earnings report but face headwinds going into...","Date":1731974400000}
{"Title":"A look at the day ahead in European and global markets from Kevin Buckland Signs are positive for European stocks' open, with futures pointing up, and equity indices across most...","Date":1731974400000}
{"Title":"By Saqib Iqbal Ahmed NEW YORK (Reuters) - Options traders are primed for a nearly $300-billion swing in Nvidia (NASDAQ:NVDA)'s market value following the chipmaker's quarterly...","Date":1731974400000}
{"Title":"A look at the day ahead in U.S. and global markets from Mike Dolan U.S. Treasuries got a rare lift on Tuesday, with speculation about Donald Trump's pick for Treasury Secretary...","Date":1731974400000}
{"Title":"On Tuesday, Truist Securities updated its stance on shares of NVIDIA Corporation (NASDAQ:NVDA), increasing the price target to $167 from the previous $148 while maintaining a Buy...","Date":1731974400000}
{"Title":"Bank of America Securities said its clients were net buyers of US equities last week, with inflows totaling $4.9 billion, marking the second consecutive week of net purchases and...","Date":1731974400000}
{"Title":"On Tuesday, an analyst from Stifel adjusted the price target for NVIDIA (NASDAQ:NVDA), increasing it to $180 from the previous $165, while reiterating a Buy rating for the stock....","Date":1731974400000}
{"Title":null,"Date":1732060800000}
{"Title":"By Fergal Smith (Reuters) -Canada's main stock index inched higher on Wednesday as gains for energy shares offset investor reluctance to make big bets ahead of the release after...","Date":1732060800000}
{"Title":"By Jamie McGeever (Reuters) - A look at the day ahead in Asian markets.  Investors hoping that Nvidia (NASDAQ:NVDA)'s eagerly-awaited earnings after the U.S. close on Wednesday...","Date":1732060800000}
{"Title":"After-Hours Stock Movers: NVIDIA (NASDAQ:NVDA) shares declined 2.3% despite reporting third quarter results and guidance that topped consensus estimates. The company's CEO Jensen...","Date":1732060800000}
{"Title":"By Chibuike Oguh and Amanda Cooper NEW YORK\/LONDON (Reuters) -Global shares edged lower on Wednesday as markets weighed tensions between Russia and the West, while bitcoin hit a...","Date":1732060800000}
{"Title":"Investing.com-- Most Asian stocks fell on Thursday as earnings from technology major Nvidia provided middling cues, while Indian markets tumbled after the U.S. accused conglomerate...","Date":1732060800000}
{"Title":"Investing.com - NVIDIA (NASDAQ: NVDA) reported fourth quarter EPS of $0.81, $0.06 better than the analyst estimate of $0.75. Revenue for the quarter came in at $35.1B versus the...","Date":1732060800000}
{"Title":"Investing.com -- Hedge funds are on pace to end 2024 on a high, with US equity long\/short strategies showing a 14% year-to-date return, Goldman Sachs revealed in a note. This is...","Date":1732060800000}
{"Title":"Investing.com -- Lynx Equity Strategies said investors should exercise patience with Nvidia (NASDAQ:NVDA)'s stock, stating they should \"step aside and look for a better entry...","Date":1732060800000}
{"Title":"Investing.com-- The Dow cut losses to close higher Wednesday, sidestepping a slump in  Target  and caution in tech ahead of Nvidia's quarterly earnings. At 4.00 p.m. ET (2100 GMT),...","Date":1732060800000}
{"Title":"By Jamie McGeever ORLANDO, Florida (Reuters) -Even bulls now admit that U.S. stocks and credit are expensive. While many argue that the rosy macro outlook will keep the party...","Date":1732060800000}
{"Title":"A look at the day ahead in European and global markets from Stella Qiu Trading was subdued in Asia with everyone waiting for the earnings results of AI darling Nvidia...","Date":1732060800000}
{"Title":"Investing.com -- Wall Street is seen trading slightly higher as investors await the release of results from chipmaker Nvidia, which could drive sentiment for the rest of the week....","Date":1732060800000}
{"Title":"Mutual fund performance was weak during the first eight months of the year but has since stabilized, according to Goldman Sachs. Only 31% of large-cap mutual funds are...","Date":1732060800000}
{"Title":"Investing.com -- Risks of a potential AI-related asset price bubble in equity markets remain despite recent corrections, the European Central Bank (ECB) warned in a recent...","Date":1732060800000}
{"Title":"On Wednesday, B.Riley adjusted its stance on  Fabrinet  (NYSE: NYSE:FN) stock, a provider of precision optical, electro-optical, and electronic manufacturing services, moving from...","Date":1732060800000}
{"Title":"On Wednesday, Loop Capital maintained a Buy rating on NVIDIA (NASDAQ:NVDA) with a steady price target of $175.00. The firm's analysis indicates that NVIDIA's anticipated demand...","Date":1732060800000}
{"Title":"Investing.com -- The path for Nvidia (NASDAQ:NVDA) to become the first company with a $4 trillion market valuation begins today, Wedbush analysts said in a note. The AI chipmaker...","Date":1732060800000}
{"Title":"Investing.com -- In a closely contested poll, investors are expected to 'buy the news' following Nvidia (NASDAQ:NVDA)'s earnings report, as the latest survey from Investing.com...","Date":1732060800000}
{"Title":"A look at the day ahead in U.S. and global markets from Mike Dolan Tuesday's geopolitical angst faded fast in world markets as positioning ahead of today's results from AI-giant...","Date":1732060800000}
{"Title":"Investing.com -- Nvidia’s latest earnings report has yielded positive implications for key players in the semiconductor supply chain, according to Stifel analysts. Nvidia...","Date":1732147200000}
{"Title":"On Thursday, Itau BBA sustained its Outperform rating on NVIDIA (NASDAQ:NVDA) shares, with a steady price target of $164.00. The firm's analysis suggests confidence in the...","Date":1732147200000}
{"Title":null,"Date":1732147200000}
{"Title":"Investing.com -- Nvidia (NASDAQ:NVDA) reported earnings for the fiscal first quarter, and the “flawless” results are a nod for investors to own the stock heading into 2025, Wedbush...","Date":1732147200000}
{"Title":"On Thursday, Evercore ISI exhibited continued confidence in NVIDIA (NASDAQ:NVDA), nudging its price target up to $190 from $189, while maintaining an Outperform rating on the...","Date":1732147200000}
{"Title":"On Thursday, Rosenblatt Securities increased its price target on NVIDIA (NASDAQ:NVDA) shares to $220 from $200, while maintaining a Buy rating on the stock. The firm recognized...","Date":1732147200000}
{"Title":"On Thursday, Truist Securities updated its outlook on NVIDIA Corporation (NASDAQ:NVDA) shares, increasing its price target to $169 from the previous $167, while reaffirming a Buy...","Date":1732147200000}
{"Title":"Investing.com -- Nvidia (NASDAQ:NVDA)'s revenue forecast for the fourth quarter fell short of investors' elevated expectations, sparking concerns about a potential slowdown in the...","Date":1732147200000}
{"Title":"Investing.com -- Nvidia’s latest earnings report highlights growing enterprise AI demand, with positive implications for server manufacturers Dell Technologies (NYSE:DELL), Hewlett...","Date":1732147200000}
{"Title":"On Thursday, Citi maintained a Buy rating on NVIDIA (NASDAQ:NVDA) and increased the price target to $175 from $170. The adjustment follows NVIDIA's recent financial performance,...","Date":1732147200000}
{"Title":"Investing.com -- US stock futures edged higher Thursday, with investors digesting results from AI-heavyweight Nvidia ahead of the release of weekly employment data.  Here are some...","Date":1732147200000}
{"Title":"On Thursday, a Craig-Hallum analyst increased the price target for NVIDIA (NASDAQ: NASDAQ:NVDA) shares to $175 from the previous $165, while maintaining a Buy rating. The...","Date":1732147200000}
{"Title":"Investing.com - Nvidia reported fiscal third-quarter results that exceeded Wall Street estimates, but its current-quarter guidance underwhelmed lofty investor expectations...","Date":1732147200000}
{"Title":"On Thursday, Cantor Fitzgerald maintained a positive outlook on NVIDIA (NASDAQ:NVDA), reiterating an Overweight rating and a $175.00 price target for the company's stock. The...","Date":1732147200000}
{"Title":"Investing.com-- Most Asian stocks rose on Friday, buoyed by strength in chipmaking and cyclical stocks, which helped markets weather heightened tensions over the Russia-Ukraine...","Date":1732147200000}
{"Title":"By  Lewis  (JO:LEWJ) Krauskopf NEW YORK (Reuters) - U.S. stocks are extending their lead over global peers and some investors believe that dominance could grow if President-elect...","Date":1732147200000}
{"Title":"SANTA CLARA, Calif., Nov.  21, 2024  (GLOBE NEWSWIRE) -- NVIDIA will present at the following events for the financial community: UBS Global Technology and AI ConferenceTuesday,...","Date":1732147200000}
{"Title":"By Chibuike Oguh and Medha Singh NEW YORK (Reuters) -An index of global stock markets edged higher in choppy trading on Thursday as investors digested lackluster revenue forecasts...","Date":1732147200000}
{"Title":"By Abigail Summerville (Reuters) -Wall Street's main indexes closed higher after choppy trading on Thursday, with the blue-chip Dow and the S&P 500 hitting one-week tops. Dow...","Date":1732147200000}
{"Title":"Investing.com -- The S&P 500 closed higher Thursday, led by cyclical stocks including financials and industrials boosting the broader market at a time when tech lagged as Google...","Date":1732147200000}
{"Title":"On Thursday, Needham, a well-known investment firm, increased its price target for NVIDIA (NASDAQ:NVDA), a major player in the graphics processing unit (GPU) market, from $145.00...","Date":1732147200000}
{"Title":"By Max A. Cherney, Arsheeya Bajwa and Stephen Nellis SAN FRANCISCO (Reuters) - Nvidia (NASDAQ:NVDA) forecast its slowest revenue growth in seven quarters on Wednesday, with the...","Date":1732147200000}
{"Title":"On Thursday, William Blair maintained an Outperform rating on NVIDIA (NASDAQ:NVDA), highlighting the anticipated success of the company's latest generation of chips, Blackwell....","Date":1732147200000}
{"Title":"By Joao Manuel Vicente Mauricio and Pranav Kashyap (Reuters) -Europe's main stock index edged up on Thursday, buoyed by a rally in energy and tech stocks that ended its longest...","Date":1732147200000}
{"Title":"On Thursday, DA Davidson updated their outlook on NVIDIA (NASDAQ:NVDA), increasing the price target to $135 from the previous $90, while keeping a Neutral rating on the stock. The...","Date":1732147200000}
{"Title":"On Thursday, Benchmark, a financial analysis firm, increased its price target on shares of NVIDIA (NASDAQ:NVDA) to $190 from the previous $170, while maintaining a Buy rating. The...","Date":1732147200000}
{"Title":"By Stephen Nellis and Aditya Soni SAN FRANCISCO\/BENGALURU (Reuters) -Nvidia's revenue forecast on Wednesday raised questions over whether the artificial intelligence boom is...","Date":1732147200000}
{"Title":"On Thursday, Wolfe Research exhibited confidence in NVIDIA (NASDAQ:NVDA) shares, increasing the tech giant's price target to $180 from the previous $150. The firm maintains an...","Date":1732147200000}
{"Title":"In a remarkable display of market confidence, Nvidia Corporation (NASDAQ:NVDA)'s stock has surged to an all-time high, reaching a price level of $149.9. This milestone underscores...","Date":1732147200000}
{"Title":"On Thursday, Goldman Sachs maintained its Conviction Buy rating on NVIDIA (NASDAQ:NVDA), increasing the price target to $165 from the previous $150. This adjustment follows...","Date":1732147200000}
{"Title":"A look at the day ahead in U.S. and global markets from Mike Dolan There's not too much to worry about at the world's most valuable company - or the artificial intelligence theme...","Date":1732147200000}
{"Title":"(The opinions expressed here are those of the author, a portfolio manager at Fidelity International.) By Taosha Wang Tech investors are facing a new form of disruption. This...","Date":1732147200000}
{"Title":"On Thursday, Cantor Fitzgerald maintained a positive outlook on NVIDIA (NASDAQ:NVDA), reiterating an Overweight rating and a $175.00 price target for the stock. The firm's...","Date":1732147200000}
{"Title":"Investing.com -- Wall Street is seen trading lower Friday, weighed by disappointment from Nvidia's guidance. Starbucks is potentially looking at options for its China business,...","Date":1732147200000}
{"Title":"On Thursday, Wedbush Securities adjusted its outlook on NVIDIA Corporation (NASDAQ:NVDA) stock, increasing the price target from $160.00 to $175.00. The firm maintained an...","Date":1732147200000}
{"Title":"On Thursday, BofA Securities maintained its Buy rating and $190.00 price target on NVIDIA (NASDAQ:NVDA) stock, following the company's financial results for the third fiscal...","Date":1732147200000}
{"Title":"On Thursday,  Morgan Stanley  (NYSE:MS) maintained its Overweight rating on NVIDIA (NASDAQ:NVDA) stock and increased the price target to $168 from $160. The firm's analyst pointed...","Date":1732147200000}
{"Title":"Investing.com-- Analysts maintained a largely positive view on NVIDIA Corporation (NASDAQ:NVDA) after the chipmaker clocked consensus-beating third-quarter earnings and presented a...","Date":1732147200000}
{"Title":"On Thursday,  Mizuho  (NYSE:MFG) maintained an Outperform rating on NVIDIA (NASDAQ: NVDA) and increased the price target to $175 from the previous $165. This adjustment follows...","Date":1732147200000}
{"Title":"A look at the day ahead in European and global markets from Ankur Banerjee The prospect of slowing sales growth at AI juggernaut Nvidia (NASDAQ:NVDA) and simmering worries over...","Date":1732147200000}
{"Title":"By Fanny Potkin (Reuters) - China's Huawei plans to start mass-producing its most advanced artificial intelligence chip in the first quarter of 2025, even as it struggles to make...","Date":1732147200000}
{"Title":"On Thursday, Baird, a financial services company, increased its price target for NVIDIA (NASDAQ: NASDAQ:NVDA) shares to $195 from the previous $150, while maintaining an...","Date":1732147200000}
{"Title":"On Thursday, Piper Sandler confirmed its Overweight rating for NVIDIA (NASDAQ:NVDA) with a consistent price target of $175.00. The firm recognized NVIDIA's robust quarterly...","Date":1732147200000}
{"Title":"On Thursday, TD Cowen updated its view on NVIDIA (NASDAQ:NVDA), raising the price target to $175 from $165, while maintaining a Buy rating on the stock. The firm expressed...","Date":1732147200000}
{"Title":"Investing.com -- Nvidia’s solid third-quarter results and guidance reinforce the positive outlook for Taiwan Semiconductor Manufacturing (NYSE:TSM), Bank of America analysts said...","Date":1732147200000}
{"Title":"On Thursday, NVIDIA (NASDAQ:NVDA) opened with a positive catalyst watch as an analyst highlighted the company's recent financial performance and future prospects. NVIDIA reported...","Date":1732147200000}
{"Title":"NVIDIA Corporation (NASDAQ:NVDA) has announced a record-breaking quarter, with total revenue reaching $35.1 billion, marking a 94% increase from the previous year. The company's...","Date":1732147200000}
{"Title":"On Thursday, Melius Research adjusted their outlook on shares of NVIDIA (NASDAQ:NVDA), increasing the price target to $195 from the previous $185, while maintaining a Buy rating...","Date":1732147200000}
{"Title":"On Thursday, Jefferies maintained its Buy rating on NVIDIA (NASDAQ:NVDA) with a consistent price target of $185.00. The firm's analysis acknowledged that NVIDIA's recent...","Date":1732147200000}
{"Title":"On Thursday, Bernstein SocGen Group updated its outlook on NVIDIA (NASDAQ:NVDA) stock, increasing the price target to $175 from $155, while maintaining an Outperform rating.  This...","Date":1732147200000}
{"Title":"On Thursday,  Deutsche Bank  (ETR:DBKGn) updated its stance on NVIDIA Corporation (NASDAQ:NVDA), increasing the price target to $140 from the previous $115, while maintaining a...","Date":1732147200000}
{"Title":"Investing.com -- Citi has placed Nvidia (NASDAQ:NVDA) on a 90-day Upside Catalyst Watch ahead of CES in January 2025.  The bank anticipates key announcements from Nvidia during the...","Date":1732147200000}
{"Title":"By Abigail Summerville and Johann M Cherian (Reuters) -Wall Street closed higher on Friday, with all three major indexes posting weekly gains, as investors took comfort from data...","Date":1732233600000}
{"Title":"Investing.com -- NVIDIA Corporation (NASDAQ:NVDA) has wobbled since its third-quarter guidance underwhelmed lofty investor expectations, but analysts from Jefferies are...","Date":1732233600000}
{"Title":"By Arsheeya Bajwa and Krystal Hu (Reuters) -Amazon.com pumped another $4 billion into OpenAI competitor Anthropic, as the e-commerce giant goes up against Big Tech rivals in a...","Date":1732233600000}
{"Title":"By Echo Wang NEW YORK (Reuters) - Artificial intelligence cloud platform CoreWeave, is aiming for a valuation of more than $35 billion in its U.S. initial public offering that is...","Date":1732233600000}
{"Title":"Investing.com – U.S. stocks were higher after the close on Friday, as gains in the Consumer Goods, Financials and Industrials sectors led shares higher._x000D_ At the close in NYSE, the...","Date":1732233600000}
{"Title":"Investing.com-- The Dow closed a fresh record high Friday, as the rotation into cyclical stocks including industrials continued to propel stocks higher amid weakness in tech.  At...","Date":1732233600000}
{"Title":"On Friday, Jefferies sustained its optimistic stance on NVIDIA Corporation (NASDAQ:NVDA), maintaining a Buy rating and a price target of $185.00. The firm believes NVIDIA is...","Date":1732233600000}
{"Title":null,"Date":1732233600000}
{"Title":"The end of the week brings a diverse set of movements among stocks, with some companies experiencing notable gains while others face declines. Mega-cap stocks like  AbbVie Inc ...","Date":1732233600000}
{"Title":"By Ankika Biswas, Joao Manuel Vicente Mauricio and Pranav Kashyap (Reuters) -European real estate stocks surged, propelling the benchmark index to a one-week high on Friday, while...","Date":1732233600000}
{"Title":"A look at the day ahead in European and global markets from Ankur Banerjee A series of manufacturing data will likely dominate markets' attention on Friday, with the euro rooted...","Date":1732233600000}
{"Title":"Investing.com -- Wall Street is set for a muted start Friday, but the main averages are on course to register a positive week. Bitcoin nears an important threshold, while the...","Date":1732233600000}
{"Title":"Investing.com -- In the weeks leading up to Donald Trump's inauguration,  Barclays  (LON:BARC) analysts foresee increased market volatility driven by speculation surrounding the...","Date":1732233600000}
{"Title":"A look at the day ahead in U.S. and global markets from Mike Dolan Darkening skies over Europe's economy, trade and politics sent the euro plummeting to its lowest in two years -...","Date":1732233600000}
{"Title":"Investing.com -- US stock futures traded in a muted fashion Friday, at the end of a generally positive week.  Here are some of the biggest premarket US stock movers today:  Gap...","Date":1732233600000}
{"Title":"Investing.com -- Phillip Securities analysts cut their rating on Nvidia (NASDAQ:NVDA) stock from Buy to Accumulate, citing recent price action. Alongside the downgrade, the firm...","Date":1732233600000}
{"Title":"Investing.com -- Here are the biggest analyst moves in the area of artificial intelligence (AI) for this week. InvestingPro subscribers always get first dibs on market-moving AI...","Date":1732406400000}
{"Title":"BEIJING (Reuters) -China welcomes the presence of Nvidia (NASDAQ:NVDA) and aims to build a better business environment for foreign firms, its vice commerce minister told an...","Date":1732492800000}
{"Title":"Investing.com -- UBS analysts have initiated coverage of  Arm  Holdings (NASDAQ:ARM)with a \"buy\" rating, setting a price target of $160 per share, which suggests a 20% upside from...","Date":1732492800000}
{"Title":"Investing.com -- Amazon is setting its sights on a new venture: reducing its dependence on Nvidia (NASDAQ:NVDA) by developing custom AI chips. According to a Bloomberg report, the...","Date":1732492800000}
{"Title":"NVIDIA (NASDAQ:NVDA) stock fell nearly 4% Monday, plummeting to a three-week low as investors continued to shift their focus towards cyclical stocks, coinciding with the Dow Jones...","Date":1732492800000}
{"Title":"By Stephen Nellis (Reuters) - Nvidia (NASDAQ:NVDA) on Monday showed a new artificial intelligence model for generating music and audio that can modify voices and generate novel...","Date":1732492800000}
{"Title":"Investing.com -- Barclays analysts have cautioned that signs of a market bubble are appearing in the wake of the U.S. presidential election, driven by retail investor exuberance...","Date":1732579200000}
{"Title":"(Reuters) -President-elect Donald Trump on Monday pledged tariffs on the United States' three largest trading partners - Canada, Mexico and China - detailing how he will implement...","Date":1732579200000}
{"Title":"On Monday, NVIDIA Corporation (NASDAQ:NVDA) shares experienced a notable decline of 4.2%, which was accompanied by a significant volume of call options being sold. Susquehanna...","Date":1732579200000}
{"Title":"Investing.com -- Investors should remain invested in US equities but shift their allocations away from highly concentrated stocks and cap-weighted indices like the S&P 500,...","Date":1732579200000}
{"Title":"By Caroline Valetkevitch NEW YORK (Reuters) - The S&P 500 will rise over 8% between now and end-2025 as U.S. interest rate cuts and potentially less regulation under...","Date":1732579200000}
{"Title":"By Tom Westbrook and Ankur Banerjee SINGAPORE (Reuters) - Investors dusted off their trade war playbooks on Tuesday, confident their portfolios were better-prepared for Donald...","Date":1732579200000}
{"Title":"Investing.com-- OpenAI will allow its employees to sell about $1.5 billion worth of shares to Japan’s SoftBank Group Corp. (TYO:9984) in a new tender offer, CNBC reported on...","Date":1732665600000}
{"Title":"By Hyunjoo Jin and Heekyong Yang SEOUL (Reuters) -Samsung Electronics sought to inject impetus into its memory and foundry chip units by appointing new leaders on Wednesday, as it...","Date":1732665600000}
{"Title":"(Reuters) -Shares of Dell (NYSE:DELL) and HP (NYSE:HPQ) fell on Wednesday after the personal computer makers issued forecasts that cast doubt on a market recovery driven by...","Date":1732665600000}
{"Title":"John Dabiri, a director at NVIDIA Corp (NASDAQ:NVDA), recently sold 716 shares of the company's stock, according to a filing with the Securities and Exchange Commission. The...","Date":1732665600000}
{"Title":"Investing.com-- U.S. stock index futures steadied on Wednesday evening following a negative session on Wall Street as weak earnings and increased regulatory jitters dented...","Date":1732665600000}
{"Title":"Investing.com-- The Biden administration is expected to unveil a comprehensive set of export restrictions aimed at further limiting China's ability to develop advanced artificial...","Date":1732665600000}
{"Title":"Investing.com-- Shares of major Chinese chipmaking firms rose sharply in Shanghai and Hong Kong trade on Friday after Bloomberg reported the U.S. was considering less strict export...","Date":1732752000000}
{"Title":"SHANGHAI\/BERLIN (Reuters) - Mercedes-Benz (OTC:MBGAF) is betting on China's Momenta to help it win back market share in the world's biggest auto market, with plans for fresh...","Date":1732838400000}
{"Title":"Investing.com -- US semiconductor stocks are on the rise in premarket trading after reports suggested that the Biden administration's anticipated export controls on China may be...","Date":1732838400000}
{"Title":"By Saeed Azhar, Johann M Cherian and Purvi Agarwal (Reuters) -The S&P 500 and Dow Jones Industrial Average notched record closing highs in a shortened Black Friday session, lifted...","Date":1732838400000}
{"Title":"NVIDIA Corporation (NASDAQ:NVDA) reported a remarkable third-quarter performance, exceeding Wall Street expectations with a revenue of $35.1 billion, significantly outpacing the...","Date":1732838400000}
{"Title":"By Wen-Yee Lee TAIPEI (Reuters) - TSMC's founder Morris Chang asked Nvidia (NASDAQ:NVDA)'s Jensen Huang to consider becoming the chief executive of the Taiwanese chip giant more...","Date":1732838400000}
{"Title":"By Naomi Rovnick, Dhara Ranasinghe and Nell Mackenzie LONDON (Reuters) - November was a month of clear winners and losers from Donald Trump's Nov. 5 U.S. election victory.  Trump...","Date":1732838400000}
{"Title":"SHANGHAI\/BERLIN (Reuters) -Mercedes-Benz is betting on China's Momenta to help it win back market share in the world's biggest auto market, with plans for fresh investment and at...","Date":1733011200000}
{"Title":"By Alexander Marrow LONDON (Reuters) - AI infrastructure firm Nebius Group on Monday said it was raising $700 million in a private placement from investors including Nvidia...","Date":1733097600000}
{"Title":"Nebius Group N.V. (NASDAQ:NBIS), an AI infrastructure firm, has secured a strategic equity financing deal worth $700 million, aimed at accelerating the expansion of its full-stack...","Date":1733097600000}
{"Title":"Investing.com -- Robinhood UK (NASDAQ:HOOD) users leaned heavily toward technology and cryptocurrency-linked stocks in November, with their top picks reflecting a clear focus on...","Date":1733097600000}
{"Title":"By Jeffrey Dastin (Reuters) - Amazon.com Inc (NASDAQ:AMZN) plans to pilot a new carbon-removal material for data centers, which are at risk of worsening emissions from artificial...","Date":1733097600000}
{"Title":"By Caroline Valetkevitch NEW YORK (Reuters) -The Nasdaq and S&P 500 scored record closing highs on Monday, boosted by tech-related shares following the market's strong November...","Date":1733097600000}
{"Title":"By Karen Freifeld and David Shepardson (Reuters) -The United States on Monday launched its third crackdown in three years on China's semiconductor industry, curbing exports to 140...","Date":1733097600000}
{"Title":"Investing.com-- The U.S. will implement its third major crackdown on China's semiconductor industry, targeting 140 entities with new export restrictions, Reuters reported on...","Date":1733097600000}
{"Title":"(Reuters) - Tesla (NASDAQ:TSLA)'s market capitalisation increased by the most among top global companies in November, boosted by expectations the automaker will benefit from CEO...","Date":1733097600000}
{"Title":"Amazon (NASDAQ:AMZN) Web Services (AWS) has announced the introduction of new data center servers equipped with its proprietary artificial intelligence (AI) chips, presenting a...","Date":1733184000000}
{"Title":"Hewlett Packard Enterprise (NYSE:HPE), a prominent player in the IT hardware and communications equipment sector with a market capitalization of $27.7 billion, has been making...","Date":1733184000000}
{"Title":"By Stephen Culp NEW YORK (Reuters) -A surprise declaration of martial law in Korea that had sent the won plummeting and gave U.S. Treasuries a brief safe-haven boost was lifted on...","Date":1733184000000}
{"Title":"On Monday, Nebius Group (NASDAQ:NBIS) experienced a notable increase in its stock price following positive remarks from Citron Research. The investment firm took to social media...","Date":1733184000000}
{"Title":"By Stephen Nellis and Greg Bensinger LAS VEGAS (Reuters) - Amazon.com (NASDAQ:AMZN)'s cloud unit on Tuesday showed new data center servers packed with its own AI chips that will...","Date":1733184000000}
{"Title":"Nvidia Corporation (NASDAQ:NVDA), a leading developer of artificial intelligence chips, is considering the use of its increasing cash reserves to pursue mergers and acquisitions,...","Date":1733184000000}
{"Title":"Investing.com -- Jefferies analysts weighed in on the latest US semiconductor export controls targeting China in a note Tuesday, highlighting that the measures are \"better than...","Date":1733184000000}
{"Title":"On Tuesday, ZJK Industrial Co., Ltd. (NASDAQ: ZJK), a manufacturer of precision metal parts for new energy vehicles and smart electronic devices, announced a significant...","Date":1733184000000}
{"Title":"Investing.com -- BofA Securities analysts double upgraded Credo Technology Group Holding Ltd (NASDAQ:CRDO) stock from Underperform to Buy on Tuesday, following the company’s strong...","Date":1733184000000}
{"Title":"Four major Chinese industry associations have advised local companies to be cautious about purchasing chips from the United States, suggesting that they are \"no longer safe\" and to...","Date":1733184000000}
{"Title":"(Reuters) - AI chip leader Nvidia (NASDAQ:NVDA) could put its growing cash pile to use through possible mergers and acquisitions, finance chief Colette Kress said during a...","Date":1733184000000}
{"Title":"By Sheila Dang (Reuters) - Elon Musk's artificial intelligence startup xAI plans to expand its Memphis, Tennessee, supercomputer to house at least one million graphics processing...","Date":1733270400000}
{"Title":"Broadcom Inc. (NASDAQ:AVGO), with its impressive market capitalization of nearly $795 billion, has been making significant strides in the artificial intelligence (AI) chip market,...","Date":1733270400000}
{"Title":"By Caroline Valetkevitch NEW YORK (Reuters) -All three major U.S. stock indexes scored record closing highs on Wednesday as technology shares rallied after upbeat results from...","Date":1733270400000}
{"Title":"Investing.com – U.S. stocks were higher after the close on Wednesday, as gains in the Technology, Consumer Services and Industrials sectors led shares higher._x000D_ At the close in...","Date":1733270400000}
{"Title":"Schneider Electric (EPA:SCHN) SE is collaborating with  Nvidia Corp  (NASDAQ:NVDA) to create cooling system designs specifically for new artificial intelligence (AI) data centers....","Date":1733270400000}
{"Title":"(Reuters) -Taiwan President Lai Ching-te was in the U.S. territory of Guam on Wednesday, his second U.S. stopover in less than a week during a tour to reinforce ties with Pacific...","Date":1733270400000}
{"Title":"By Foo Yun Chee BRUSSELS (Reuters) -EU antitrust regulators are asking Nvidia (NASDAQ:NVDA) customers if they have been offered discounts to buy the company's graphics processing...","Date":1733270400000}
{"Title":"By Stephen Nellis (Reuters) - French electrical equipment maker Schneider Electric (EPA:SCHN) is working with Nvidia (NASDAQ:NVDA) to develop designs for data center cooling...","Date":1733270400000}
{"Title":"NVIDIA Corporation (NASDAQ:NVDA) continues to cement its position as a leader in the artificial intelligence (AI) and high-performance computing markets, with exceptional...","Date":1733356800000}
{"Title":"(Reuters) - Hewlett Packard Enterprise (NYSE:HPE) beat Wall Street expectations for fourth-quarter revenue and profit on Thursday, as it benefits from strong demand for its...","Date":1733356800000}
{"Title":"On Thursday, OpenAI introduced ChatGPT Pro, a new subscription tier of its chatbot ChatGPT, designed to cater to the engineering and research sectors with a monthly fee of $200....","Date":1733356800000}
{"Title":"SANTA CLARA, Calif., Dec.  05, 2024  (GLOBE NEWSWIRE) -- NVIDIA announced today it is opening its first Vietnam research and development center, signaling its confidence in the...","Date":1733356800000}
{"Title":"NVIDIA (NASDAQ:NVDA) announced today it is opening its first Vietnam research and development center, signaling its confidence in the country’s bright artificial intelligence...","Date":1733356800000}
{"Title":"Investing.com -- Taiwan Semiconductor Manufacturing (NYSE:TSM) (TSMC) is in talks with  Nvidia Corp  (NASDAQ:NVDA) to produce the tech giant’s Blackwell AI chips at TSMC's new...","Date":1733356800000}
{"Title":"By Krystal Hu Canadian AI startup Cohere, last valued at $5.5 billion, will focus on building tailored models for enterprise users over larger foundation models, the company told...","Date":1733356800000}
{"Title":"(Reuters) - Broadcom (NASDAQ:AVGO) said on Thursday its custom chip unit, which makes AI processors for cloud providers, has developed new technology to enhance semiconductor...","Date":1733356800000}
{"Title":"The Greater Memphis Chamber's Annual Chairman’s Luncheon was the stage for a significant announcement by xAI, detailing the expansion of their \"Colossus\" supercomputer facility....","Date":1733356800000}
{"Title":"In a significant move to advance artificial intelligence (AI) capabilities,  Nvidia Corp . (NASDAQ:NVDA) has entered into a cooperation agreement with the Vietnamese government....","Date":1733356800000}
{"Title":"By Wen-Yee Lee and Fanny Potkin TAIPEI\/SINGAPORE (Reuters) - Taiwan Semiconductor Manufacturing Co is in discussions with  Nvidia Corp  (NASDAQ:NVDA) to produce its Blackwell...","Date":1733356800000}
{"Title":"By Stephen Nellis (Reuters) - Italian startup iGenius and Nvidia (NASDAQ:NVDA) on Thursday said they are planning to bring online one of the world's biggest deployments of...","Date":1733356800000}
{"Title":null,"Date":1733443200000}
{"Title":"The European Union's antitrust regulators are conducting an inquiry into Nvidia (NASDAQ:NVDA)'s sales practices, questioning whether the leading artificial intelligence chipmaker...","Date":1733443200000}
{"Title":"By Foo Yun Chee BRUSSELS (Reuters) - EU antitrust regulators are asking Nvidia (NASDAQ:NVDA) rivals and customers if the U.S. artificial intelligence chipmaker bundles its...","Date":1733443200000}
